{
    "possible_locations": [
        "APOLLO COFFEE BAR",
        "OBSESSIVE CHOCOLATE DESIRE ICE CREAM CAFE",
        "SOD Cafe SG",
        "AMBER EMBER",
        "Hook Coffee",
        "ESTATION CAFÉ",
        "SIR STAMFORD WAFFLES",
        "Magic After Hours",
        "Be Dazzled By Magic Performances During Your Dinner At Cafe Football This 11 October",
        "WILD BLOOMS",
        "Five &2",
        "MS DURIAN",
        "A•MOS PERFECT GELATO",
        "PRODIGAL CAFE",
        "All The Batter",
        "GATHER THE MISFITS",
        "C PLUS",
        "Fat Po",
        "PAYA LEBAR QUARTER MALL",
        "ORIENTAL ICE BISTRO"
    ],
    "users": [
        0
    ],
    "APOLLO COFFEE BAR": {
        "price": "S$10 – S$25 per pax",
        "rating": "5.0",
        "place_id": "NA",
        "total_cost": "NA",
        "address": "65 Serangoon Garden Way",
        "postal_code": "555961",
        "operating_hours": "Operating Hours: 10am - 1am (Sun - Thu), 10am - 2am (Fri & Sat)",
        "pictures": "{https://sethlui.com/wp-content/uploads/2019/12/Apollo-Coffee-Bar-2013.jpg,https://sethlui.com/wp-content/uploads/2019/12/Apollo-Coffee-Bar-2021.jpg,https://sethlui.com/wp-content/uploads/2019/12/Apollo-Coffee-Bar-2040.jpg,https://sethlui.com/wp-content/uploads/2019/12/Apollo-Coffee-Bar-2042.jpg,https://sethlui.com/wp-content/uploads/2019/12/Apollo-Coffee-Bar-2109.jpg,https://sethlui.com/wp-content/uploads/2019/12/Apollo-Coffee-Bar-2144.jpg,https://sethlui.com/wp-content/uploads/2019/12/Apollo-Coffee-Bar-2048.jpg,https://sethlui.com/wp-content/uploads/2019/12/Apollo-Coffee-Bar-2147.jpg,https://sethlui.com/wp-content/uploads/2019/12/Apollo-Coffee-Bar-2160.jpg,https://sethlui.com/wp-content/uploads/2019/12/Apollo-Coffee-Bar-2086.jpg,https://sethlui.com/wp-content/uploads/2019/12/Apollo-Coffee-Bar-2183.jpg,https://sethlui.com/wp-content/uploads/2019/12/Apollo-Coffee-Bar-2164.jpg,https://sethlui.com/wp-content/uploads/2019/12/Apollo-Coffee-Bar.jpg}",
        "writeup": "Trust me when I say that I’ve had my fair share of hipster cafes. God forbid another floral-themed brunch spot pops up selling the typical food—truffle fries, eggs benedict, breakfast platters… Well, you get the picture. Luckily, Apollo Coffee Bar at Serangoon Gardens strays away from that stereotype with its delicious Japanese fusion food. You can look forward to unique, never-before-seen dishes like Miso Mushroom Bacon Risotto, Pork & Pear Tartine, and Tofu Hummus. The folks behind Apollo Coffee Bar aren’t new to the cafe industry. In fact, they’re the same team that brought us Atlas Coffeehouse, Columbus Coffee Co, and Lunar Coffee Brewers, which are all well-known cafes that have garnered its own throng of die-hard fans. The minute I stepped into Apollo Coffee Bar, I was greeted with the smell of freshly-ground coffee. I instantly fell in love with the cafe’s warm lighting, greenery, and white-washed walls, and noticed how there were different types of seats to cater to different groups of people. For example, if you’re looking for a table for two or dining alone, there are a handful of wall-mounted tables and bar stools located in a corner of the cafe. My favourite spot in the entire cafe would be the pseudo al fresco dining located at the back of the cafe. It’s not actually outdoors—the space is air-conditioned—but it still gives off the vibes of dining outdoors thanks to the soft sunlight from the glass ceiling. Apollo Coffee Bar’s menu is split into three sections: brunch, small plates, and large plates. We ordered the Nori, Avo & Eggs (S$18.50) from the brunch menu, which came with smashed avocadoes, nori jam, crispy kale, ciabatta, and scrambled eggs. Every single bite of this simple slice of toast was fresh, creamy, tangy, and absolutely mind-blowingly delicious. The nori jam was slightly sweet, the avocadoes provided a well-needed creaminess, and the crunchy kale was delightfully crispy and salty. Not to mention, the ciabatta was so crispy that there was an audible crunch when I used my knife to cut into it. The sound reminded me of baked bread that was so fresh that it would crackle, just like an ASMR video. To be entirely frank, when I saw the Tofu Hummus (S$12.50) on the menu, it didn’t appeal to me at all. I thought to myself: “Tofu hummus, fried maple beancurd skin, and paprika and chilli oil? How would that turn out?” However, thanks to the staff’s recommendation, I decided to order it. Man, I’m so glad I did. This made for a great snack. Each piece of fried beancurd skin was so thin that I’d go so far to say that it was brittle, delicate, and fragile. Maple honey was dripping from it, and when I picked it up, it coated my fingers with a thin film of sticky syrup. The tofu hummus was creamy, tangy, and smooth, with a consistency that reminded me of yoghurt. Most of the flavour came from the deep-fried beancurd skin, the sticky sweet maple syrup, as well as a fiery spicy kick from the paprika and chilli oil. Honestly speaking, it was so finger-licking good that I couldn’t stop myself from polishing off this entire bowl. For mains, we tried the Miso Mushroom Bacon Risotto (S$22), which came with miso bacon, oyster mushrooms, fried enoki, farro grains, and an organic jammy egg. I loved that the risotto wasn’t mushy or overly soggy. Rather, it was creamy and there was a nice springy bite to it, just like pearl barley. Though the risotto had an earthy spice to it, as if cinnamon had been added to the dish, I loved stumbling upon the occasional piece of bacon because it was intensely salty and incredibly addictive. If you’re feeling indulgent, try its Shishito Chilli Chicken (S$19). Two large chicken drumsticks were coated in a blend of East Asia shishito pepper spices and paired with two fluffy garlic potato buns. When I bit into the chicken drumstick, I was immediately hit by an intense and rich meatiness that reminded me of rustic beef chilli cheese gravy. It was so addictive and hard to put down that my dining companion and I actually finished our drumsticks in one go. It was that good. For dessert, I tried Apollo Coffee Bar’s Miso Caramel Soft Serve (S$7), which came with a dollop of Japanese miso soft serve and piled high with in-house caramel popcorn. Salty, earthy, and packed with umami flavours, the soft serve blew my mind. It was satisfying and indulgent, while the use of miso cut through the sweetness from the caramel and balanced the richness out. After the meal, my dining companion and I sat across each other with utterly full tummies and satisfied smiles. I’m not even kidding when I say that the two of us polished off everything that had been placed in front of us—not because we were hungry, mind you, but because it was just so good. Whether I’m looking for a productive place to get some work done or to dine at with my friends and family, Apollo Coffee Bar has definitely found itself on my list of favourite cafes. Expected Damage: S$10 – S$25 per pax  ",
        "0": {
            "cost_for_user": "NA",
            "latitude": "NA",
            "longtitude": "NA",
            "transport_type": "NA",
            "transport_type_id": "NA",
            "node": "NA",
            "start_vid": "NA",
            "end_vid": "NA",
            "start_user": 0,
            "start_user_name": "web_host",
            "restaurant_x": "103.8654194",
            "restaurant_y": "1.363468588"
        }
    },
    "OBSESSIVE CHOCOLATE DESIRE ICE CREAM CAFE": {
        "price": "None",
        "rating": "4.0",
        "place_id": "NA",
        "total_cost": "NA",
        "address": "529 Ang Mo Kio Ave 10, #01-2353",
        "postal_code": "560529",
        "operating_hours": "Operating Hours: 12noon -10pm (Wed - Mon), 6pm - 10pm (Tue)",
        "pictures": "{https://sethlui.com/wp-content/uploads/2019/04/obsessive-chocolat-desire-ocd-cafe-ang-mo-kio-1.jpg,https://sethlui.com/wp-content/uploads/2019/07/OCD-Cafe-1.jpg,https://sethlui.com/wp-content/uploads/2019/07/OCD-Cafe-2-e1562679828962.jpg,https://sethlui.com/wp-content/uploads/2019/07/OCD-Cafe-3.jpg,https://sethlui.com/wp-content/uploads/2019/07/OCD-Cafe-4.jpg,https://sethlui.com/wp-content/uploads/2019/07/OCD-Cafe-5.jpg,https://sethlui.com/wp-content/uploads/2019/07/OCD-Cafe-6.jpg,https://sethlui.com/wp-content/uploads/2019/07/OCD-Cafe-7.jpg}",
        "writeup": "Obsessive Chocolate Desire Cafe (OCD Cafe) is an ice cream cafe located along Ang Mo Kio Ave 10. As the name suggests, they’re known for their extensive range of chocolate flavours. Recently, OCD Cafe has launched their newest creations, so we had to head back to try them. Our first order of business was the Affogato (S$8), an espresso shot with a scoop of ice cream and chocolate shavings. This is perfect for people who need a boost of caffeine to kickstart their day. Alternatively, you can also order their Ice Latte (S$6) which is also new on their menu. What I was most excited to try was the Corn Cheese Waffle (S$6), which we topped it with a scoop of Salted Dark Chocolate Ice Cream (S$3.60). I was surprised to see there were bits of corn kernels in the waffle as I presumed it would be blended with the waffle batter. The Salted Dark Chocolate was strong in flavour, though the distinct richness of the chocolate was only present in the aftertaste. Each bite of the waffle and ice cream was savoury with a lingering sweetness from the chocolate. It was a little confusing for my tastebuds, but everything went well together.  Another new addition is their Truffle Waffle (S$8), and we paired it with a single scoop of Salted Caramel Ice Cream (S$3.60). Black truffle spots were visible as we cut into the waffle. When I first tried the waffle on its own, the taste of truffle was pretty faint. Unexpectedly, the hint of truffle was more noticeable when consumed with the ice cream. You can also select any ice cream flavour to go with the Ice Cream Sandwich (S$6). We went with Sanguinello Blood Orange and Pistachio to go with their homemade cookie sandwich. Personally, I prefer my cookies to have a crunchy exterior with a soft and chewy interior. However, if you like crispy cookies, you might want to try ordering this. What I liked about the cookies was that it wasn’t too overly sweet. We highly recommend ordering the refreshing and fragrant Rose Green Tea (S$5) after all the sugary treats. Sip on it slowly to wash down all the sinfully indulgent desserts, and you can even request for a refill of hot water. With a range of chocolate flavours and bites for an affordable price, OCD Cafe has come up with a great menu once again. Perfect for a tea break! Dates & Times: Now available at OCD Cafe Prices: S$5 – S$9.60 per item",
        "0": {
            "cost_for_user": "NA",
            "latitude": "NA",
            "longtitude": "NA",
            "transport_type": "NA",
            "transport_type_id": "NA",
            "node": "NA",
            "start_vid": "NA",
            "end_vid": "NA",
            "start_user": 0,
            "start_user_name": "web_host",
            "restaurant_x": "103.8554554",
            "restaurant_y": "1.372343582"
        }
    },
    "SOD Cafe SG": {
        "price": "$12 – $20 per pax",
        "rating": "nan",
        "place_id": "NA",
        "total_cost": "NA",
        "address": "51 Hougang Ave 9, Ci Yuan CC, #01-03",
        "postal_code": "538776",
        "operating_hours": "None",
        "pictures": "{https://sethlui.com/wp-content/uploads/2018/02/sod-cafe-15.jpg,https://sethlui.com/wp-content/uploads/2018/02/sod-cafe-14.jpg,https://sethlui.com/wp-content/uploads/2018/02/sod-cafe-1.jpg,https://sethlui.com/wp-content/uploads/2018/02/sod-cafe-3.jpg,https://sethlui.com/wp-content/uploads/2018/02/sod-cafe-2.jpg,https://sethlui.com/wp-content/uploads/2018/02/sod-cafe-4.jpg,https://sethlui.com/wp-content/uploads/2018/02/sod-cafe-6.jpg,https://sethlui.com/wp-content/uploads/2018/02/sod-cafe-7.jpg,https://sethlui.com/wp-content/uploads/2018/02/sod-cafe-5.jpg,https://sethlui.com/wp-content/uploads/2018/02/sod-cafe-9.jpg,https://sethlui.com/wp-content/uploads/2018/02/sod-cafe-13.jpg,https://sethlui.com/wp-content/uploads/2018/02/sod-cafe-12.jpg,https://sethlui.com/wp-content/uploads/2018/02/sod-cafe-10.jpg,https://sethlui.com/wp-content/uploads/2018/02/sod-cafe-11.jpg,https://sethlui.com/wp-content/uploads/2018/02/sod-cafe-16.jpg,https://sethlui.com/wp-content/uploads/2018/02/sod-cafe-17.jpg}",
        "writeup": "While cafes are a dime a dozen in Singapore, have you ever heard of a cafe offering bubble tea in a jug and served on trays? Introducing the first-ever cafe in Singapore, which started from none other than a bubble tea kiosk! Nestled rather obscurely in Ci Yuan Community Club at Hougang is SOD Cafe SG. From its first bubble tea shop in Yew Tee, SOD Cafe SG has decided to branch out to a cafe setting serving up very affordable artisan food with a chill ambience. Located on the ground floor of Ci Yuan CC, it has a cosy cafe setting with around 40 seats. With its clear open windows, the cafe has an air of spaciousness that adds to its relaxing vibes, making it absolutely ideal for guests to have a quiet afternoon while sipping their bubble tea leisurely. For those wondering where the cafe’s seemingly random name comes from, SOD actually stands for “Super Oxide Dismutase”, an important antioxidant predominant in the unique tea leaves the cafe uses. SOD tea, as it is called, is caffeine-free and the main ingredient behind the delicious and healthy bubble tea served here. Wait, that’s the bubble tea? In the jug? As if bubble tea in a cafe is not bizarre enough, imagine my surprise when I ordered bubble tea and was served a tray instead! Ready or not, here’s SOD Cafe SG’s signature SOD Milk Tea ($4.50). And yes, you do drink the tea straight out of the jug! A few sips in and I was pleasantly surprised by the fragrance of the tea. Compared to other alternatives, SOD Cafe SG’s version was lighter and did not have a bitter aftertaste, attributed to its caffeine-free SOD tea mix. The best part is that you can drink this at any time of the day and still get a good night’s sleep. Served with your own choice of topping (Black Pearls, White Pearls or Aloe Vera) and syrup on the side, you can add in as much as you like. I like the mild sweetness of the tea without any additional sweetening, however, my advice is to leave the syrup out as the pearls add to the sweetness of the tea. With its light, aromatic flavour, believe me when I say that this is one of my favourite milk tea renditions to date. And you can even share this drink with friends! But I’m keeping the jug all to myself. A more intriguing tea ‘tray’ you can have is SOD’s Summer Fruit SOD Tea ($6.50). With the same signature SOD tea as the base, this tea is infused with passion fruit and adorned with an assortment of fresh fruit. Don’t fret, your eyes weren’t playing tricks on you in the photo above. Served in a lopsided tilting glass is a piece of lime frozen in an ice cube. The glass is so cool, I almost felt like I was James Bond drinking a potent elixir. Each sip of this beverage was a burst of vibrant fruity flavour. With strong notes of citrus from the strawberries and lime, the tea had a subtle sweetness that balanced the tanginess. Altogether, the drink was very refreshing and right for accompanying the heavier mains. Apart from these two beverages, SOD Cafe SG have a progressive menu of drinks featuring its signature SOD tea. For those who are too busy to come down to the cafe, the good news is that a more premium list of tea can be purchased online. In fact, if you order above $30, you can wave goodbye to the delivery charge! To whet my appetite, I started the meal with Glazed Chicken Wings ($7.50). Glistening golden-brown, these deep-fried mid-joints were very crispy. When I bit into them, I heard a glorious crunch that was really satisfying. I do admit, however, that the wings were a little too sweet. Perhaps the most interesting dish on the menu was the Smoked Duck Spaghetti ($9.50). Within the bowl, the pasta was cooked al dente and flavoured with very thin slices of duck meat. My favourite part, clearly, was the bonito flakes, which were slightly crisp and added a nice contrasting texture to the dish. Although the duck slices were tiny in size, the flavour permeated well into the noodles. Sinful and fatty, I would liken the smoked duck bits to adding lard to char kway teow. Oh, how could I forget the lightly poached egg on top? Just watching the silky yolk burst out was absolutely sublime. While the egg could have used a touch of salt, the yolk itself coated the pasta well and added a more decadent flavour to the overall dish. On to the fan-favourite among diners, the Spaghetti Aglio Olio With Prawns ($13.50) was a spicy combination of pasta, stir-fried with olive oil, garlic and chilli before being topped with juicy crystal prawns. When I say spicy, I mean spicy! I’m just baffled by how some diners would ask for this dish to be cooked spicier. Honestly, I wasn’t a big fan of this dish contrary to popular belief. The pasta I had could have been cooked longer, while the prawns, albeit thick and juicy, were a tad rubbery. Nonetheless, those hungry for something tongue-burning will definitely not be disappointed. Presenting to you the Chicken Supreme ($9.50), this dish is a succulent chicken thigh cooked with melted cheese and sits atop a bed of potato gratin. To my delight, I noticed the rather interesting addition of prawn pieces in the cheese that made for a more wholesome bite. However, the slight toughness of the chicken thigh was a bit of a letdown. Finally, the desserts! Like any good cafe, SOD Cafe SG whips up some pretty spectacular desserts to round up the meal. Here is their very own homemade Yuzu Tart ($5.50) topped with fresh pomelo. Digging in, the yuzu curd filling had a heavenly silkiness and a zesty flavour that was really punchy. While the shortcrust pastry was not as crumbly as I would have liked, the tart itself did hold well. The star of this dish, however, was the pomelo on top. The juice that burst out in every bite added a delicate sweetness and tanginess that really uplifted the tart. I also highly recommend getting the Matcha Oreo Tart ($5.50). The Oreo cookie crumbs double as both a delicious base as well as the perfect complement to counter the bitterness from the matcha. Upon closer examination, I was thrilled to see how smooth the matcha chocolate ganache filling was. It was rich, luscious and surprisingly not too sweet. Altogether, it was the ideal indulgent treat to wrap up the meal. Even though some of the mains were hit-or-miss, some dishes like the Smoked Duck Spaghetti (my favourite!) were able to steal the show. On top of no GST and service charge, many plates are priced under $10, making it a prime spot for affordable cafe food to the HDB dwellers in Hougang. The main draw is still the cafe’s delicious yet healthy bubble tea, which lived up to my expectations. With Singapore’s bubble tea culture following a buy-and-go regime, how about taking the time to sit down and fully enjoy a cup (or rather a jug) for once? Expected Damage: $12 – $20 per pax",
        "0": {
            "cost_for_user": "NA",
            "latitude": "NA",
            "longtitude": "NA",
            "transport_type": "NA",
            "transport_type_id": "NA",
            "node": "NA",
            "start_vid": "NA",
            "end_vid": "NA",
            "start_user": 0,
            "start_user_name": "web_host",
            "restaurant_x": "103.882978",
            "restaurant_y": "1.375429016"
        }
    },
    "AMBER EMBER": {
        "price": "S$8 – S$20 per pax",
        "rating": "4.5",
        "place_id": "NA",
        "total_cost": "NA",
        "address": "730 Upper Serangoon Road, #01-01",
        "postal_code": "534613",
        "operating_hours": "None",
        "pictures": "{https://sethlui.com/wp-content/uploads/2018/09/Amber-Ember-7.jpg}",
        "writeup": "I’ve often wondered why hipster cafes are a go-to for many when they’re in need of a coffee fix or a place to do their work. Mine has always been Starbucks until I chanced upon Amber Ember at Upper Serangoon. This homely yet picturesque cafe provides the ideal space to get your coffee fix. You might even find yourself lingering longer because it’s so comfortable! This cafe isn’t like any other, and it comes with its own story — the owner of Amber Ember, Abigail, created this space with the idea to make it like a home. With her architect background, she designed every part of the cafe herself, from picking out furniture pieces to painting the walls. Using warm lights, marble tables, wooden benches and plants, the cafe looks like the quaint little backyard of someone’s home. You can come here for a coffee fix and snag a corner seat to do your work or you can try their Jaffles, like everyone else who comes here! ‘Jaffles’ is the Australian version of toasted sandwiches, or toasties. We went straight for the sweet Jaffles, because why not have dessert first? The PB & Jelly Jaffle (S$8), recommended by Abigail, was the perfect choice for us. Amber Ember’s PB & Jelly comes with homemade peanut butter, grape jelly and a frozen peanut parfait. Once toasted, the exterior was warm and crispy, while the peanut parfait interior was still cold. Unlike the conventional PB & Jelly sandwich, the consistency of the parfait made it extremely light on the palate. Despite the combination of jelly and peanut butter, it wasn’t too sweet and we felt that it was a really enjoyable dish to start with. For a savoury choice, we went for the Truffle Shrooms Jaffle (S$11), which came with a side of purple mash.  You can hardly go wrong with truffle and mushrooms together, and Amber Ember serves up a crispy toast filled with mushroom duxelle, portobello, pickled shimeiji and cheddar cheese. What I loved about the jaffle was its umami flavour. Yet if you’re expecting it to be too rich, it isn’t overwhelming and the portion was just nice. But if you want something heavier, try the Medi Brunch (S$12). The plate explodes in colour with vibrant red hummus, fresh red cherry tomatoes and golden cous cous. I expected this dish to be slightly bland, but the combination of ingredients created a burst of flavours — the tomatoes accentuated the sweetness of the dish. Pair it with the miso butter cauliflower for a savoury bite. Apart from the usual brunch food, Amber Ember offers something that brings a little more familiarity. The Asian ‘Risotto’ (S$10) is a purple rice porridge served with sides of braised pork, runny egg, fried shallots and garlic.  Amber Ember chooses to cook their rice into a risotto consistency rather than a congee consistency. Due to the cooking method, you’ll find the porridge is slightly thicker with a rougher texture. But that’s what I love about it. You can savour the porridge together with its toppings, especially the braised pork, for a more balanced flavour profile. You won’t be disappointed by their sides either. Amber’s Fried Chicken (AFC) (S$10) was uniquely tasty — six pieces of wings fried to perfection and drizzled with Sriracha and blue cheese ranch. Battered and fried to perfection with just the right amount of sauce and seasoning, this side dish will tingle your taste buds. For all you coffee lovers, Amber Ember doesn’t disappoint at all! The coffee has a robust body, and it lingers on the palate. Despite that, it doesn’t leave too much of a bitter or acidic aftertaste. I love their iced whites, but you can try their black coffee as well. Amber Ember provides the comfort of a home with quality jaffles and brunch dishes. Pop over to Upper Serangoon to treat yourself! They’re still refining their menu and some dishes may not be permanent, but you won’t be disappointed with their thoughtfully curated dishes. Expected Damage: S$8 – S$20 per pax",
        "0": {
            "cost_for_user": "NA",
            "latitude": "NA",
            "longtitude": "NA",
            "transport_type": "NA",
            "transport_type_id": "NA",
            "node": "NA",
            "start_vid": "NA",
            "end_vid": "NA",
            "start_user": 0,
            "start_user_name": "web_host",
            "restaurant_x": "103.8780651",
            "restaurant_y": "1.353374511"
        }
    },
    "Hook Coffee": {
        "price": "$14 – $40 per week (depending on how much coffee you drink a week)",
        "rating": "nan",
        "place_id": "NA",
        "total_cost": "NA",
        "address": "15-4 Jalan Riang",
        "postal_code": "358969",
        "operating_hours": "None",
        "pictures": "{https://sethlui.com/wp-content/uploads/2018/04/hook-coffee-15.jpg,https://sethlui.com/wp-content/uploads/2018/04/hook-coffee-12.jpg,https://sethlui.com/wp-content/uploads/2016/04/Subscription-Boxes-7.jpg,https://sethlui.com/wp-content/uploads/2018/04/hook-coffee-13.jpg,https://sethlui.com/wp-content/uploads/2018/04/hook-coffee-23.jpg,https://sethlui.com/wp-content/uploads/2018/04/hook-coffee-14.jpg,https://sethlui.com/wp-content/uploads/2018/04/hook-coffee-10.jpg,https://sethlui.com/wp-content/uploads/2018/04/hook-coffee-8.jpg,https://sethlui.com/wp-content/uploads/2018/04/hook-coffee-7.jpg,https://sethlui.com/wp-content/uploads/2018/04/hook-coffee-4.jpg,https://sethlui.com/wp-content/uploads/2018/04/hook-coffee-3.jpg,https://sethlui.com/wp-content/uploads/2018/04/hook-coffee-2.jpg,https://sethlui.com/wp-content/uploads/2018/04/hook-coffee-11.jpg,https://sethlui.com/wp-content/uploads/2018/04/hook-coffee-19.jpg,https://sethlui.com/wp-content/uploads/2018/04/hook-coffee-22.jpg,https://sethlui.com/wp-content/uploads/2018/04/hook-coffee-25.jpg,https://sethlui.com/wp-content/uploads/2018/04/hook-coffee-24.jpg}",
        "writeup": "First, we had Spotify subscription, then Netflix. Now, I present to you coffee delivered straight to your doorstep! That’s what you’ll be getting with Hook Coffee, Singapore’s own online subscription service for your daily caffeine fix. A good cup of coffee can make or break your day ahead. Hook Coffee has you covered, because they combine affordable quality coffee and convenience to suit your busy work life. Hook Coffee’s founders, Ernest and Faye, were just typical Singaporean students trying to get through university. While pursuing degrees at prestigious UK universities, they had a brainwave — why not start a coffee business? After getting their degrees, they launched Hook Coffee in January 2016. Asian parents must be shrieking in horror, so I had to ask, “How did you convince your parents?” To which, Ernest replied with a laugh, “Just ask.” The journey wasn’t easy. Their first office was a storeroom in a three-storey shophouse in Jalan Besar. But after securing a $50,000 ACE Startups Grant from Spring Singapore and a $25,000 loan from his parents, they got the business on track. Two years on, they are one of Singapore’s most successful online businesses and even have plans to expand overseas. Hook Coffee’s subscription fully depends on you. The coffee sold here starts from an affordable $14 for 200g of coffee (around 12 cups), with no shipping charges! If you’re iffy about subscription-based services, the good news is you don’t have to commit to anything long-term with Hook Coffee. Your subscription depends on how much coffee you want, and how frequent you want it. It can be edited, paused or cancelled at any time. This personalised subscription means your coffee is delivered to you according to how fast you consume your coffee. Your subscription frequency can be customised, whether its a bag of coffee every two days or even one every 35 days. This way, you’ll never have to worry about having too much or too little coffee on your hands. Let’s face it, coffee is all about the quality. To ensure this, Hook Coffee insists on a stringent process of sourcing for their own beans. “We get coffee from partners that we source from various parts of the world. Buying directly from the farmers gives us direct access and better control, and the farmers also get a bigger cut.” That’s how the good guys at Hook Coffee ensure full transparency with their sourcing, sustainably and ethically. They also helped me to clarify some misconceptions about coffee. Coffee Myth #1: Specialty coffee is the same as artisan coffee. Speciality coffee refers to coffee that is graded 80 and above on a scale of 100 by a certified coffee taster. This is the only kind of beans that Hook Coffee uses. Coffee Myth #2: Good beans are everything for quality. Not true. Another important aspect of coffee quality is the roast. Hook Coffee ensures this with their expert ‘bean whisperers’ who handle the roasting themselves. To ensure freshness, Hook Coffee roasts their beans locally, and they promise that the coffee will reach your doorstep no more than a week after roasting! But with great quality comes great sacrifice. Their coffee experts roast over 300kg of coffee every week, a process involving hauling and heavy-lifting. Head of Coffee, Kit, even remarked, “That’s how we save on gym memberships!” With beans sourced from Africa, South America, Central America, and Asia, Hook Coffee has a vast repertoire of freshly-roasted speciality coffee for you to choose from, each with their own unique flavour profile. Fancy a rum-tasting coffee called Rum Baby Rum? Before you start thinking that Hook Coffee spikes their coffee, there’s actually no rum in Rum Baby Rum. The name is merely Hook Coffee’s way of keeping things easy for coffee amateurs, so they know the flavours of what they’re choosing. Rum Baby Rum is actually a medium roast of Ethiopian beans, which tastes just like rum! Their Strawberry Fields coffee roast also supposedly has hints of ‘Tochigi strawberries’. Likewise, all their other coffee roasts have flavours which come naturally, with no artificial oils added. Hook Coffee makes things easy by letting you identify the flavour profile of a coffee from its name alone. There’s no need to worry about accidentally picking up a coffee roast you don’t like. With interesting flavours and punny names, such as Madame Lychee and The Grape Gatsby, these coffee roasts are definitely cool beans. I arranged a cupping session with Hook Coffee to test first-hand if their speciality coffee really has the advertised flavour. The coffee tasting was done blind and I had to guess the different coffee roasts from the aroma and flavour profile alone. After being freshly grounded, it was time to put the eight different coffee roasts to the test. Even with my untrained senses, I was able to pick up on some of the stronger aromas that were surprisingly familiar, like notes of chocolate and berries. I was even able to distinguish between two different chocolate-flavoured coffee beans, one of which had an additional nutty aroma. Next, hot water was added to the coffee for four minutes. Don’t worry about the crusty layer forming on the surface. It’s just the undissolved coffee grounds rising up to the top. If your coffee comes up white when you add in the water, it might mean your coffee isn’t fresh. For comparison’s sake, Hook Coffee showed me a coffee roast that was roasted more than a week ago so I could see the difference. Whew, now I won’t ever get scammed into buying stale beans! The best way to taste it is to get a spoonful and slurp it. After scoring the flavour profiles, these were my findings. While a few had more subtle flavours, most of the coffee roasts had pretty distinct flavours. In particular, I enjoyed the coffee roasts with stronger fruity flavours as the delicate sweet notes were really delicious. I correctly identified those with the chocolate flavours as Kopi Sutra (a dark-roasted Indonesian coffee described as having hints of ‘black forest cake’), while the one with the nutty aroma was Sweet Bundchen (a medium dark-roasted Brazilian coffee described as having hints of ‘kinder bueno’). I also identified my favourite, Rum Baby Rum, correctly. No surprise here, considering my regular alcohol binging. This coffee’s rum flavour is spot on! I’ll admit that I’m no coffee connoisseur. It really is a testament to the strong flavour profiles of Hook Coffee’s roasts that I could correctly identify so many coffee types. One of Hook Coffee’s best features is its user-friendliness. On Hook Coffee’s website, choosing the coffee roast best-suited for you is easy. The menu is really foolproof with all the details for the different coffee roasts displayed clearly. It even includes information on the flavours to give you an idea of what to expect. I appreciated the date of roasting which lets me know how fresh the beans are. If you’re indecisive, Hook Coffee’s recommendation questionnaire helps you select your perfect coffee based on flavour, your brewing method and how strong you like your coffee. It’s a match! I can safely vouch that the recommendation was spot on for me. Pruno Mars really suited my palate when I tried it during the taste test, as it was filled with bright fruity accents that I love in my coffee. Another thing I really love about Hook Coffee is how easy they make it for lazy people. I would honestly rather purchase a $5 black coffee than making one at home myself. Thankfully, Hook Coffee has the solution. The coffee is nicely packaged and small enough to fit in your letterbox, so you can just collect your coffee whenever you’re free. While you can drink their coffee in any brewing method you like, nothing beats these convenient coffee Drip Bags (10 bags from $14 for subscribers, $18 for non-subscribers). They’re essentially pocket-sized coffee filters, which are great when you’re on the go. These are actually Hook Coffee’s ShotPods (set of 20 at $14 for subscribers, $18 for non-subscribers). They’re compatible with Nespresso machines, and are equally fresh and tasty as coffee by the bag. So don’t worry about subscribing if you’ve already bought a Nespresso machine, because you can just pop these in for some fresh coffee. I’m pretty nosy, so I asked, “Has anyone ever blamed you for bad coffee when they mess up the brewing process on their own?” While Hook Coffee encourages all their subscribers to experiment with the brewing method, don’t try anything too strange. If you want to be safe, Hook Coffee recommends specific brewing methods for each of their coffee roasts. There’s also a brewing guide for first-time coffee makers. So the next time your coffee goes bad, don’t immediately blame the beans. Do some trouble-shooting of your own, or send a distress call to Hook Coffee’s team on their website’s chat function. More than the affordable costs, Hook Coffee’s main draw is their quality and freshness. Quality is one thing I’ll never compromise in my daily cup, so thank God I don’t have to drink shoddy coffee anymore. So if you’re lazy like I am, then you need Hook Coffee’s home-delivered speciality coffee. With their line-up of unique coffee flavours, wake up to a good cuppa speciality coffee that is guaranteed to get you hooked. This is one subscription you won’t regret going premium for! Expected Damage: $14 – $40 per week (depending on how much coffee you drink a week)",
        "0": {
            "cost_for_user": "NA",
            "latitude": "NA",
            "longtitude": "NA",
            "transport_type": "NA",
            "transport_type_id": "NA",
            "node": "NA",
            "start_vid": "NA",
            "end_vid": "NA",
            "start_user": 0,
            "start_user_name": "web_host",
            "restaurant_x": "103.8675529",
            "restaurant_y": "1.34793642"
        }
    },
    "ESTATION CAFÉ": {
        "price": "S$10 – S$20 per pax",
        "rating": "5.0",
        "place_id": "NA",
        "total_cost": "NA",
        "address": "505 Ang Mo Kio Ave 8, #01-2674",
        "postal_code": "560505",
        "operating_hours": "Opening Hours: 8am – 5pm (Mon – Fri), Closed on Sat & Sun",
        "pictures": "{https://sethlui.com/wp-content/uploads/2019/05/EStation-Cafe-1.jpg,https://sethlui.com/wp-content/uploads/2019/05/EStation-Cafe-11.jpg,https://sethlui.com/wp-content/uploads/2019/05/EStation-Cafe-14.jpg,https://sethlui.com/wp-content/uploads/2019/05/EStation-Cafe-13.jpg,https://sethlui.com/wp-content/uploads/2019/05/EStation-Cafe-2.jpg,https://sethlui.com/wp-content/uploads/2019/05/EStation-Cafe-3.jpg,https://sethlui.com/wp-content/uploads/2019/05/EStation-Cafe-8.jpg,https://sethlui.com/wp-content/uploads/2019/05/EStation-Cafe-6.jpg,https://sethlui.com/wp-content/uploads/2019/05/EStation-Cafe-7.jpg,https://sethlui.com/wp-content/uploads/2019/05/EStation-Cafe-4.jpg,https://sethlui.com/wp-content/uploads/2019/05/EStation-Cafe-9.jpg,https://sethlui.com/wp-content/uploads/2019/05/EStation-Cafe-10.jpg}",
        "writeup": "EStation Café is a relatively new addition to the few cafes hidden within the Ang Mo Kio neighbourhood. Opened in early 2019, this cosy space exudes warmth and homeliness. The handwritten menu, heart shaped Post-It’s on the wall, and subtle decorations were all little finishing touches that made EStation Café reminiscent of a Taiwanese café transplanted into the Singaporean heartlands. The food here at EStation Café is primarily Western, however, there are very pronounced Asian influences to the cooking. There’s even a local twist to some of the items on the menu, and I was very excited to try them. I started off with the Chilli Crab Crayfish Spaghetti (S$17.90) which might not be the cheapest item on the menu, but it’s certainly worth the money. The generous serving of crayfish plated beautifully and the meat was succulent and fresh. The spaghetti was cooked al dente and had a firm bite. Subtly sweet, the spaghetti paired nicely with the chilli crab sauce, which was pretty authentic. The sauce was tangy and savoury with a faint sweetness and was supremely satisfying. Prepared with a blend of crab and crayfish meat, this full-bodied sauce also went pretty well with the crayfish. If I had a few mantous to go with the chilli crab sauce, this would have been a clear winner for me. The pairing of chilli crab sauce with spaghetti was executed fairly well here. However, the chilli crab sauce was on the spicy side, so you might want to get a drink to go with it. I grabbed the Tri-Colour Coffee (S$6.90) which features a sweet, perfectly pulled espresso shot mixed with full-cream milk. The espresso shot was not too bitter, resulting in a nutty and slightly sweet drink that was delectably creamy. It really helped to douse the flames from the Chilli Crab Crayfish Spaghetti. I simply had to try out the ES Café Otak with Pearl Rice (S$11.90) which is one of the best-selling items here. The concept of the dish is rather intriguing, as it blends Peranakan and Japanese cuisines. There was a generous portion of thick fish otak which was amazing. The chefs at EStation Café make it from scratch in-house rather than going the easy route and using a commercially-available, processed otak, and I could taste the difference. I loved how the soft fish and complex chilli spice blend went well together, rounded off with the fragrance of burnt attap leaves. It’s definitely not an easy dish to prepare from scratch, and I have to commend EStation Café for a job well done. The chicken satay could use some improvements though. It lacked that authentic char characteristic of most good satay. Luckily, the peanut sauce used was fairly decent. The achar (pickled vegetables) was tangy and possessed a nice crunch, but might be a little on the intense side in terms of sourness. The star of the dish would be the pearl rice, which was a deep cobalt blue due to an infusion of butterfly pea flower. The grains of rice themselves were soft, fluffy and chewy. There was also a delicate, subtle floral flavour to it which I felt went well with every other item in this dish. I would come back to EStation Café again simply to have their ES Café Otak with Pearl Rice. At this price point and amount of effort put into each ingredient, I’d say you’ll be getting your money’s worth with this dish. I also had the Teriyaki Chicken Steak (S$12.90) which is a hit with the secondary school students who frequent this café. I can understand why; the chicken steak was massive and absolutely delicious. The thick teriyaki sauce glaze also added a thin gelatinous layer on the skin of the chicken, which gave every bite a slightly different mouthfeel from other chicken cutlets. The meat was super flavourful, soft and tender, and was infused with the sweetness of the teriyaki sauce. The dish comes with a serving of house salad as well as shoestring fries, which were perfectly salted and seasoned. I would definitely come back to have this again! EStation Café is one of the hidden gems in Ang Mo Kio that surprised me with the quality of food served. The Teriyaki Chicken Steak absolutely blew my mind with the perfectly grilled meat and flavourful teriyaki sauce. I also appreciated the local twist in the ES Café Otak with Pearl Rice, which is also a winner for me. I would definitely want to come back to this café before the crowds do – given the quality and relative affordability of the food served, I can see long queues forming up here in no time. Expected Damage: S$10 – S$20 per pax",
        "0": {
            "cost_for_user": "NA",
            "latitude": "NA",
            "longtitude": "NA",
            "transport_type": "NA",
            "transport_type_id": "NA",
            "node": "NA",
            "start_vid": "NA",
            "end_vid": "NA",
            "start_user": 0,
            "start_user_name": "web_host",
            "restaurant_x": "103.8502249",
            "restaurant_y": "1.37485973"
        }
    },
    "SIR STAMFORD WAFFLES": {
        "price": "S$3 – S$14 per pax",
        "rating": "4.0",
        "place_id": "NA",
        "total_cost": "NA",
        "address": "727 Ang Mo Kio Avenue 6, #01-4264",
        "postal_code": "560727",
        "operating_hours": "Operating Hours: 12noon - 12midnight (Mon - Thu), 12noon - 1am (Fri), 11am - 1am (Sat), 11am - 12midnight (Sun)",
        "pictures": "{https://sethlui.com/wp-content/uploads/2019/08/sir-stamford-waffles-ang-mo-kio-1.jpg,https://sethlui.com/wp-content/uploads/2019/08/sir-stamford-waffles-ang-mo-kio-2.jpg,https://sethlui.com/wp-content/uploads/2019/08/sir-stamford-waffles-ang-mo-kio-10.jpg,https://sethlui.com/wp-content/uploads/2019/08/sir-stamford-waffles-ang-mo-kio-13.jpg,https://sethlui.com/wp-content/uploads/2019/08/sir-stamford-waffles-ang-mo-kio-8.jpg,https://sethlui.com/wp-content/uploads/2019/08/sir-stamford-waffles-ang-mo-kio-9.jpg,https://sethlui.com/wp-content/uploads/2019/08/sir-stamford-waffles-ang-mo-kio-11.jpg,https://sethlui.com/wp-content/uploads/2019/08/sir-stamford-waffles-ang-mo-kio-15.jpg,https://sethlui.com/wp-content/uploads/2019/08/sir-stamford-waffles-ang-mo-kio-12.jpg,https://sethlui.com/wp-content/uploads/2019/08/sir-stamford-waffles-ang-mo-kio-45.jpg,https://sethlui.com/wp-content/uploads/2019/08/sir-stamford-waffles-ang-mo-kio-5.jpg,https://sethlui.com/wp-content/uploads/2019/08/sir-stamford-waffles-ang-mo-kio-16.jpg,https://sethlui.com/wp-content/uploads/2019/08/sir-stamford-waffles-ang-mo-kio-17.jpg,https://sethlui.com/wp-content/uploads/2019/08/sir-stamford-waffles-ang-mo-kio-18.jpg,https://sethlui.com/wp-content/uploads/2019/08/sir-stamford-waffles-ang-mo-kio-19.jpg,https://sethlui.com/wp-content/uploads/2019/08/sir-stamford-waffles-ang-mo-kio-23.jpg,https://sethlui.com/wp-content/uploads/2019/08/sir-stamford-waffles-ang-mo-kio-22.jpg,https://sethlui.com/wp-content/uploads/2019/08/sir-stamford-waffles-ang-mo-kio-21.jpg,https://sethlui.com/wp-content/uploads/2019/08/sir-stamford-waffles-ang-mo-kio-20.jpg,https://sethlui.com/wp-content/uploads/2019/08/sir-stamford-waffles-ang-mo-kio-24.jpg,https://sethlui.com/wp-content/uploads/2019/08/sir-stamford-waffles-ang-mo-kio-31.jpg,https://sethlui.com/wp-content/uploads/2019/08/sir-stamford-waffles-ang-mo-kio-30.jpg,https://sethlui.com/wp-content/uploads/2019/08/sir-stamford-waffles-ang-mo-kio-35.jpg,https://sethlui.com/wp-content/uploads/2019/08/sir-stamford-waffles-ang-mo-kio-32.jpg,https://sethlui.com/wp-content/uploads/2019/08/sir-stamford-waffles-ang-mo-kio-29.jpg,https://sethlui.com/wp-content/uploads/2019/08/sir-stamford-waffles-ang-mo-kio-26.jpg,https://sethlui.com/wp-content/uploads/2019/08/sir-stamford-waffles-ang-mo-kio-28.jpg,https://sethlui.com/wp-content/uploads/2019/08/sir-stamford-waffles-ang-mo-kio-25.jpg,https://sethlui.com/wp-content/uploads/2019/08/sir-stamford-waffles-ang-mo-kio-36.jpg,https://sethlui.com/wp-content/uploads/2019/08/sir-stamford-waffles-ang-mo-kio-27.jpg,https://sethlui.com/wp-content/uploads/2019/08/sir-stamford-waffles-ang-mo-kio-37.jpg,https://sethlui.com/wp-content/uploads/2019/08/sir-stamford-waffles-ang-mo-kio-38.jpg,https://sethlui.com/wp-content/uploads/2019/08/sir-stamford-waffles-ang-mo-kio-39.jpg,https://sethlui.com/wp-content/uploads/2019/08/sir-stamford-waffles-ang-mo-kio-41.jpg,https://sethlui.com/wp-content/uploads/2019/08/sir-stamford-waffles-ang-mo-kio-40.jpg,https://sethlui.com/wp-content/uploads/2019/08/sir-stamford-waffles-ang-mo-kio-43.jpg,https://sethlui.com/wp-content/uploads/2019/08/sir-stamford-waffles-ang-mo-kio-42.jpg,https://sethlui.com/wp-content/uploads/2019/08/sir-stamford-waffles-ang-mo-kio-3.jpg,https://sethlui.com/wp-content/uploads/2019/08/sir-stamford-waffles-ang-mo-kio-7.jpg}",
        "writeup": "2019 marks Singapore’s bicentennial anniversary, and most of us would’ve seen images of Sir Stamford Raffles around. We may know who Sir Stamford Raffles is, but what about ? To be honest, I thought he was a distant relative of our founder. However, it turns out Sir Stamford Waffles is actually the name of a cafe! Located in , the tiny cafe serves up a range of local delights, but with a modern twist. The first dish which caught our attention was the Slipper Lobster Roll (S$12.90) .  I’ve had a fair share of lobster rolls in my life, but never at such an affordable price. Although a slipper lobster isn’t actually a true lobster, I was still looking forward to trying their take on it. For one, the huge chunks of glistening slipper lobster meat were a sight to behold. Each piece was succulent and juicy, to our delight. We noticed that they had also tossed the slipper lobster meat in a creamy sauce. As we took a bigger bite, we realised it was actually egg mayo! It was evident that they were very generous with it as every bite we took was simply oozing with it. I personally felt that buttery notes of the egg mayo made for an excellent pairing with sweet slipper lobster. As with traditional lobster rolls out there, they stuffed all the ingredients in a hot dog-style bun.  We unanimously agreed that the ratio of bread to ingredients was perfect. However, the bun was slightly too tough for our liking. The dish also came with some chips, as well as a portion of their housemade achar . The achar was very fresh, and the sour notes hit the right spots. Even my dining partner, who doesn’t typically eat his veggies, finished it! With all that said, though, it was Sir Stamford Waffles’ Butterfly Pea Nasi Lemak (S$9.90) which piqued my curiosity. The royal blue hue made for a very elegant and aesthetically-pleasing presentation.  The staff explained that they infused the rice with butterfly pea flower to achieve its colour, but that’s not all. Apparently, they also grow their own butterfly pea flowers in Malaysia! Because of that, the rice actually had a subtle floral aroma. It was simply a bonus that every grain of rice was firm but pleasantly chewy. Sir Stamford Waffles makes their own hae bee hiam (spicy dried shrimp paste) too. It was bursting with notes of sweetness, which I felt went really well with the rice. Nasi lemak can’t possibly be complete without sambal too, right? They make a smoky sambal paste that’s not too spicy, perfect for those with low spice tolerance (like me). Give it a good mix together with the rice and hae bee hiam before digging into it. You’ll thank me later. The dish also came with a plethora of other ingredients. For vegetables, you can expect their housemade achar , as well as curry mixed vegetables. Meanwhile, I’m sure all you meat lovers will enjoy their grilled chicken, which came with a delightfully crispy skin. There was an otah too, which was decently spicy and juicy. Completing the dish were then the quintessential hard-boiled egg and peanuts with ikan bilis . With so many ingredients, this dish is definitely fit for a king, if you ask me! Sir Stamford Waffles isn’t just all about ‘the salty’ food, as they call it. They also serve up a unique range of ice cream flavours, which were what we were mainly there for. While they do serve their ice creams a la carte , we figured we’d go for their Unicorn Waffle (S$14) .  The dessert was essentially a waffle and ice cream dish. However, they meticulously beautified it with sugar decorations so that it’d resemble a unicorn!  For this absolutely Instagram -worthy piece of art, we were allowed to choose our own ice cream flavours. We went for the Kaya Roti , as well as Cereal ice cream. The Kaya Roti ice cream is apparently Sir Stamford Waffles’ most popular flavour. According to the staff, it’s usually out of stock as it sells out very quickly. Hence, we were very lucky that day to be in time for a new batch. After my first bite, I immediately understood why. The ice cream had a prominent taste and aroma of pandan , which was such a nostalgic treat. I personally felt it was reminiscent of the pandan kaya cake from Bengawan Solo, but even stronger in taste. True to its name, they even mixed actual pieces of white bread into the ice cream! This gave every bite a slightly chewy texture which I enjoyed very much. The waffles at Sir Stamford Waffles weren’t the typical huge slabs which we usually encounter. Instead, theirs were much lighter, with a shape even resembling a snowflake.  Though they were admittedly slightly bland, the strong and unique ice cream flavours certainly compensated for it. Likewise, the Choochi Monster (S$14) was an equally Instragrammable dish. It featured my favourite Sesame Street character, Cookie Monster. For this dish, the ice cream flavours were pre-set: Cookies & Cream and Blue Peppermint Chocolate Chip .  The Cookies & Cream ice cream was nothing much to rave about, sadly. It was very one-dimensional in taste and texture. That said, however, the Blue Peppermint Chocolate Chip pleasantly  surprised us.  Not only did it possess a refreshing minty flavour, but there was also an abundance of chocolate chips in it. As a chocolate lover, there was nothing I didn’t love about it. If you have a sweet tooth, why not end off your meal with a thick and chocolatey Milkshake (S$10) ? The richness of the chocolate will definitely give you an energy boost to get you through the day.  The mod-sin creations over at Sir Stamford Waffles were certainly innovations done right. That said, I wonder which famous person’s name is going to be adapted next. Sang Nila Nutella sounds like a good name for a chocolate cafe, no? Expected Damage: S$3 – S$14 per pax",
        "0": {
            "cost_for_user": "NA",
            "latitude": "NA",
            "longtitude": "NA",
            "transport_type": "NA",
            "transport_type_id": "NA",
            "node": "NA",
            "start_vid": "NA",
            "end_vid": "NA",
            "start_user": 0,
            "start_user_name": "web_host",
            "restaurant_x": "103.8460633",
            "restaurant_y": "1.372655163"
        }
    },
    "Magic After Hours": {
        "price": "$50 per pax",
        "rating": "nan",
        "place_id": "NA",
        "total_cost": "NA",
        "address": "Café Football Singapore, The Arena, 48 Woodleigh Park (PUB Recreation Club)",
        "postal_code": "357844",
        "operating_hours": "None",
        "pictures": "{https://sethlui.com/wp-content/uploads/2017/11/CF-Magic-08.jpg,https://sethlui.com/wp-content/uploads/2017/11/CF-Magic-02.jpg,https://sethlui.com/wp-content/uploads/2017/11/CF-Magic-01.jpg,https://sethlui.com/wp-content/uploads/2017/11/CF-Magic-04.jpg,https://sethlui.com/wp-content/uploads/2017/11/CF-Magic-10.jpg,https://sethlui.com/wp-content/uploads/2017/11/CF-Magic-05.jpg,https://sethlui.com/wp-content/uploads/2017/11/CF-Magic-06.jpg,https://sethlui.com/wp-content/uploads/2017/11/CF-Magic-28.jpg,https://sethlui.com/wp-content/uploads/2017/11/CF-Magic-29.jpg,https://sethlui.com/wp-content/uploads/2017/11/CF-Magic-13.jpg,https://sethlui.com/wp-content/uploads/2017/11/CF-Magic-17.jpg,https://sethlui.com/wp-content/uploads/2017/11/CF-Magic-21.jpg,https://sethlui.com/wp-content/uploads/2017/11/CF-Magic-25.jpg,https://sethlui.com/wp-content/uploads/2017/11/CF-Magic-26.jpg}",
        "writeup": "You’d think that the closer you are to the magic performance, the easier it would be to spot the trick. But here at Cafe Football’s Magic After Hours, even getting up close and personal with the magicians may not help you figure out their secret. Tucked away in The Arena, this cosy cafe is decked out with — you guessed it — football paraphernalia. At the Magic After Hours event, you’ll get to select your meal beforehand, so they can serve it once you’re seated. For $50, it includes a three-course meal and spellbinding performances. Start your meal off with a cool drink in hand, refreshing on the palate and fizzy on the tongue. With a sweet lychee flavour and a subtle minty fresh taste, the Back Pass opened up my appetite for the meal ahead. Another drink option is the Red Devil Jr. Vibrantly red with pureed strawberry bits in it, this drink is perfect for those who like it sweet. The orange slice added a zesty bite to the otherwise sweet beverage. Getting into the meal, we started off with the Mushroom Truffle Soup. The smooth and thick stew was punctuated with bits of mushroom, and the fragrance of the truffle emanated strongly from the dish. Unlike most places which serve their soup with garlic bread, Café Football served theirs with a crunchy churro. Slightly sweet and definitely crispy on the outside, the churro complemented the flavourful mushroom soup perfectly. Most places can do a decent three-course meal, but at Magic After Hours, your meal comes with entertainment. “Pick a card, any card!”, The magician came up to our table to perform for us, and I have to say, this was a whole different experience from the usual stage performances. You’d think that this close-up, it would be easy to spot the trick. But no, I was still incredibly amazed when the magician guessed my card correctly. After that brief interlude, it’s back to the food. Diners get a choice of two mains: the Grilled Salmon with Lemon Capers Salsa and Mashed Potato, or the Half BBQ Chicken with Curly Fries. I really enjoyed the Grilled Salmon, which was juicy and soft. Each bite of salmon simply just fell apart easily in my mouth. The slight zesty taste of the salsa also helped to brighten the flavour of the dish. I also really liked how the mashed potato was a bit chunky, but still creamy at the same time. The Half BBQ Chicken was huge; there was no way I would be able to finish it on my own. The BBQ sauce was full of flavour, but I found the meat itself to be a tad too dry. The barbeque flavour was a bit subtler on the inside, with a slightly charred taste. As I usually go for the smoother chicken thigh meat, this dish didn’t appeal to me as much as the salmon. I really enjoyed the curly fries that came on the side. Every bite was crispy and delivered that starchy potato goodness too. After the mains, another magical interlude was at hand. Think Nguyen from Belgium surprised us with a snappy card swap. Through an amazing sleight of hand, he managed to swap four aces for the same number of threes, right in front of our unsuspecting eyes. Nigel’s performance leaned more towards the spookier side of magic. With pendulums swinging unaided and spirits communicating through the slate board, I could feel tingles running down my spine. He ended off with an eerily accurate prediction of the audience member who was spontaneously chosen to assist. From a sealed envelope, he took out a written description of her, down to the colour of her dress and her earring design. Now, that’s magic! A quick hop back to the table for the dessert: this slice of Classic Cheesecake was dense, smooth and creamy, and hit all the right spots. The crumbly cookie base added the right amount of oomph to this sweet ending. And the final performance of the night was Ming Da, one of Singapore’s fastest rising stars in the magic scene. He amazed us with classic yet difficult tricks like passing coins through a solid table, and even pulled a knotted scarf loose from around a guest’s arm. But the highlight of the night was his final trick. Blindfolded, he managed to stab a knife through cards that audience members have selected. Even more amazing was that he found the correct cards in the scattered deck on the table! That’s definitely the coolest thing I’ve seen. If you’re intrigued by this magical dining experience, there is one more session coming up. Mark your calendars for 13 December 2017. You won’t want to miss this! Expected Damage: $50 per pax",
        "0": {
            "cost_for_user": "NA",
            "latitude": "NA",
            "longtitude": "NA",
            "transport_type": "NA",
            "transport_type_id": "NA",
            "node": "NA",
            "start_vid": "NA",
            "end_vid": "NA",
            "start_user": 0,
            "start_user_name": "web_host",
            "restaurant_x": "103.8676271",
            "restaurant_y": "1.342506445"
        }
    },
    "Be Dazzled By Magic Performances During Your Dinner At Cafe Football This 11 October": {
        "price": "None",
        "rating": "nan",
        "place_id": "NA",
        "total_cost": "NA",
        "address": "Cafe Football Singapore, 48 Woodleigh Park",
        "postal_code": "357844",
        "operating_hours": "None",
        "pictures": "{https://sethlui.com/wp-content/uploads/2017/09/Magic-After-Hours-03-800x533.jpg,https://sethlui.com/wp-content/uploads/2017/09/Magic-After-Hours-04-800x533.jpg}",
        "writeup": "Add a little hocus pocus to your regular meals with Cafe Football’s Magic After Hours. No sleight of hand here; this football-themed pub in Woodleigh Park has been playing host to these interactive, entertaining feasts, including a three-course meal and fascinating magic performances. If you’re a fan of street magic performances (or if you have a short attention span while munching), you’ll enjoy this intimate setting full of enthralling trickery. Experience theatrical magic up close and personal, as you sip on a complimentary mocktail. Choose from creatively named drinks such as Red Devil Jr, Fair Play, and Back Pass. Trying to crack these tricks can work up quite an appetite, so treat yourself to the three-course meal. Start with Mushroom Truffle Soup, and decide between Half BBQ Chicken with Curly Fries or Grilled Salmon and Lemon Capers Salsa with Mashed Potato. Then, end your meal off with a sweet slice of cake. Expect the unexpected as your meal is peppered with magic tricks and head-scratching puzzlers. You may leave happily full after the meal, but your curiosity will be unsatisfied. After all, a magician never reveals his secrets! Prices: $50 (single ticket), $88 (pair of tickets) Date & Time: 11 October 2017, 7.30pm – 9.30pm (Seating begins at 7pm)",
        "0": {
            "cost_for_user": "NA",
            "latitude": "NA",
            "longtitude": "NA",
            "transport_type": "NA",
            "transport_type_id": "NA",
            "node": "NA",
            "start_vid": "NA",
            "end_vid": "NA",
            "start_user": 0,
            "start_user_name": "web_host",
            "restaurant_x": "103.8676271",
            "restaurant_y": "1.342506445"
        }
    },
    "WILD BLOOMS": {
        "price": "S$10 – S$20 per pax",
        "rating": "4.0",
        "place_id": "NA",
        "total_cost": "NA",
        "address": "1187 Upper Serangoon Road, #01-01, The Midtown Residences",
        "postal_code": "534785",
        "operating_hours": "Opening Hours: (Daily) 11am – 11pm",
        "pictures": "{https://sethlui.com/wp-content/uploads/2019/01/Wild-Blooms-6.jpg}",
        "writeup": "Let’s be honest, cafes are overrated. I think I’ve had enough of overpriced club sandwiches and cappuccinos. Not to mention, having to jostle with the ever-enthusiastic weekend crowd is fairly unpleasant. Lucky for me, I chanced upon Wild Blooms while looking for a new place to work remotely. Located in the heartlands of Hougang, Wild Blooms is a cosy two-floored cafe. The picturesque cafe is filled with dried flowers, and the blue-tinted windows help to keep the cafe cool under the hot sun. As you walk into the cafe, you’ll realise that the first floor is not very spacious. It can only host two customers at a time and the rest of the floor is kitchen space. The owners of Wild Blooms have specially created a gigantic hand-made flower wall. Yes, it’s time to up your Instagram game. Head upstairs and you’ll find more seats if you are with a bigger group. The walls are cobalt blue and the windows are tinted in the same hue. While I love the consistent colour scheme, I felt the indigo hue made the space feel really cramped. We started snacking on our first dish, the Matcha Seaweed Fries (S$8.90). The piping hot fries were tossed in matcha powder and sprinkled with dried seaweed flakes and icing sugar. This whole combination might sound weird to you, but the fries were surprisingly super addictive. I couldn’t stop munching on them and with every bite, I could taste the umami from the seaweed followed by a hint of sweetness from the icing sugar. As addictive as the fries were, I couldn’t really taste the matcha due to the overpowering seaweed flavour. If you’re not a big fan of matcha but crazy about seaweed fries, this might just be perfect for you. Next up, we had their Charcoal Wings (S$10.90 for half a dozen). Now, it might not look like much in the photo, but let me tell you, these glazed wings are not to be missed. I wasn’t expecting much when the wings were placed on the table, because they looked just like regular honey glazed wings, but tinted black. The wings were coated in homemade spicy squid ink and they definitely had a spicy kick to them. Biting into the crispy outer layer revealed juicy chicken that was just as flavourful. It tasted more like the ever-familiar Korean sweet-and-spicy fried chicken. We Singaporeans can never get enough of that salted egg goodness and Wild Blooms cashes in on that. For our first main, we tried their Chicken Waffle (S$13.90), which comes with a choice of either maple syrup or salted egg sauce. Naturally, we opted for the salted egg sauce. Sandwiched between two waffles, the fried chicken was crispy and juicy but unfortunately lacked flavour. I was a little disappointed because their deep-fried wings were so flavourful. Moreover, the shredded lettuce didn’t go well with this chicken and waffles dish. The shredded lettuce retained some moisture, which made the waffles and fried chicken soggy and diluted the salted egg sauce too. Disappointed by the Chicken Waffle, I was hesitant to try their Beef Ochazuke (S$14.90). Luckily, the Beef Ochazuke was completely different compared to the first dish. Using Japanese rice, the dish was topped with tender marbled beef slices, seaweed shreds and a sprinkle of roasted white sesame. Served with house-brewed roasted tea leaves, the Beef Ochazuke definitely stood out. The savoury roasted tea was bland by itself, but it elevated the shredded seaweed and gave the tea a whole different flavour profile. The briny seaweed flavour blended with the tea and the beef slices. Mixing the rice and toppings together soaked up the savoury ‘soup’, making each mouthful absolutely delicious. After finishing up our mains, we got the super Instagrammable flower jelly. The intricate Flower Tea Jelly Cake (S$12.90)  is a collaboration between Wild Blooms and  T.U.B (The Utopian Botanist). Every flower is painstakingly handcrafted. The jelly cake might look delicate but surprisingly, it had a rather firm texture. Made with osmanthus tea, the jelly was light on the palate and quite refreshing. For those who want to try their hand at making these pretty flower jellies, Wild Blooms and The Utopian Botanist are collaborating for an upcoming workshop on 3 April 2019. At S$200 per pax, it may be a little pricey but you’ll get to keep the crafting needles and the jellies. If the food and desserts are not enough, Wild Blooms also serve alcohol. (Score!) They offer beers at S$5 per can and S$20 for a bucket of five, and wines at S$9 per glass. Even though a few of the dishes came up short, if you’re around Hougang you should give Wild Blooms a go.  I’d recommend getting their Charcoal Wings, Beef Ochazuke and of course, their beautifully made Flower Tea Jelly Cake. Expected Damage: S$10 – S$20 per pax",
        "0": {
            "cost_for_user": "NA",
            "latitude": "NA",
            "longtitude": "NA",
            "transport_type": "NA",
            "transport_type_id": "NA",
            "node": "NA",
            "start_vid": "NA",
            "end_vid": "NA",
            "start_user": 0,
            "start_user_name": "web_host",
            "restaurant_x": "103.8951208",
            "restaurant_y": "1.370735883"
        }
    },
    "Five &2": {
        "price": "$7 – $30 per pax",
        "rating": "nan",
        "place_id": "NA",
        "total_cost": "NA",
        "address": "Punggol Park, 97 Hougang Avenue 8",
        "postal_code": "538792",
        "operating_hours": "None",
        "pictures": "{https://sethlui.com/wp-content/uploads/2018/04/five-2-resized-3.jpg,https://sethlui.com/wp-content/uploads/2018/04/five-2-resized-6.jpg,https://sethlui.com/wp-content/uploads/2018/04/five-2-resized-17.jpg,https://sethlui.com/wp-content/uploads/2018/04/five-2-resized-18.jpg,https://sethlui.com/wp-content/uploads/2018/04/five-2-resized-19.jpg,https://sethlui.com/wp-content/uploads/2018/04/five-2-resized-7.jpg,https://sethlui.com/wp-content/uploads/2018/04/five-2-resized-12.jpg,https://sethlui.com/wp-content/uploads/2018/04/five-2-resized-11.jpg,https://sethlui.com/wp-content/uploads/2018/04/five-2-full-size-24-e1524635523179.jpg,https://sethlui.com/wp-content/uploads/2018/04/five-2-resized-10.jpg,https://sethlui.com/wp-content/uploads/2018/04/five-2-resized-13.jpg,https://sethlui.com/wp-content/uploads/2018/04/five-2-resized-16.jpg,https://sethlui.com/wp-content/uploads/2018/04/five-2-resized-14.jpg,https://sethlui.com/wp-content/uploads/2018/04/five-2-resized-5.jpg,https://sethlui.com/wp-content/uploads/2018/04/five-2-resized-15.jpg}",
        "writeup": "A fairly new addition to the Hougang area, Five &2 was opened late November 2017 at Punggol Park. Boasting both an indoor seating area and an alfresco dining area, the bistro’s location by the lake makes it the perfect idyllic spot for a meal. We were heartened to hear about the bistro’s two founding social missions: providing work opportunities to the marginalised and delivering nutritious meals to resource-poor children from the ages of two to six. Founded by Timbre Group’s Managing Director Edward Chia and two other partners, Five &2’s name stems from its promise to abide by their two social missions as well as to deliver a fresh and nutritious meal to an underprivileged child with every five meals sold. The team also works with organisations, such as Singapore Corporation of Rehabilitative Enterprises (SCORE), SPD and SG Enable to hire ex-inmates and people with slight disabilities. Working with marginalised employees requires careful planning to accommodate their needs. Even when considering additions to the menu, the employees come first. To create an inclusive environment where everyone can fulfil the entire range of duties, Five &2 uses technology to adapt the job scopes. Firstly, they’ve introduced automated cocktail/ mocktail machines that are pre-programmed with the ratios of mixes to reduce the amount of physical effort needed. Secondly, the bistro operates on a semi-service system. Customers can opt for self-order and self-payment, and placing the buzzer on the table informs the staff where to send the food to once it’s ready. After the meal, diners can return their own trays to get their $1 deposit back. Consequently, they reduced the service charges to a mere two percent instead of the usual ten percent. With our hearts full from hearing about the concept behind the bistro, we moved on to satiate our empty stomachs. The Golden Chicken Wings ($9.80) were highly recommended by Edward, who dubbed Chef Gino’s special homemade chilli sauce a definite “must-try”. When the dish was served to our table, our senses were immediately stimulated by the aroma (and sight) of the freshly fried chicken. It tasted as good as it smelled — deep fried to perfection with a satisfyingly crunchy batter and moist and tender meat. But, the star of the dish was really the chilli sauce. Creamy with hints of sweet Thai chilli and light tanginess from the calamansi; it was the sort of spice that lingers on the tip of your tongue and slowly, merrily, burns and tingles. Fair warning: it might be too spicy for those with a low tolerance for spicy food. But, it paired so well with the savoury chicken wings that I couldn’t give it up. The Sarawak Chicken Curry ($12.80) was labelled as “our personal favourite” for a good reason — it’s probably one of the best curry chicken dishes I’ve had thus far. The chicken was competing with the gravy to win my heart and they’ve earned an equal share. The chicken was really tender and the curry was rich and thick, with a nice nutty flavour. Spice-wise, it provided a more comforting kick that was nowhere near as potent as Chef Gino’s Chilli Sauce. The chunks of potato in the dish were also done just right. I appreciated how the chef thoughtfully fried the potato before adding it in to ensure that while it’s nice and soft, it doesn’t turn to mush in the curry. I found the dish to be worth its slightly steeper price tag. The Sarawak Chicken Curry was really the epitome of a nice comfort meal. Sadly, the Crab Meat Pasta ($18.80) was a bit of a letdown, especially in comparison with the other dishes which were fantastic. The pasta was done al-dente and I liked how each strand was well-coated with the sauce. However, I felt that that the tomato base was a little too rich and overwhelmed the crabmeat flavour. It also got jelak after a while. For those in the mood for seafood, perhaps opt for the Vongole ($18.80) instead? The Vongole is served with clams cooked in Chef Gino’s spicy white wine cream broth and an alternative is the Norwegian Black Mussels ($18.80), which is served with the same broth. The seafood was well-cooked, albeit a little gritty in the case of the clams, but the broth was what won me over. You know how sometimes shellfish can turn out a little too fishy and thus off-putting? This broth had none of that problem. Rather, it was perfectly infused with the sweetness of the shellfish and hints of Tom Yum flavour in the broth gave it a nice kick. The broth was so addictive that I was ended up slurping spoonful after spoonful. After having our food quota more than filled for the day, we moved on to some cocktails. A play on the classic Gin & Tonic, Five &2’s G & Tea ($12) features Oolong-infused gin, strawberry syrup and tonic. An easy drink to knock back, it was light and refreshing with a hint of Oolong that lingered behind as an aftertaste. The strawberry syrup is served in a separate glass, so diners can adjust the level of sugar. The sweetness of the strawberry syrup tempered the slight bitterness of the Oolong nicely. Besides the G & Tea, the two other cocktails on Five &2’s menu sounded equally quirky and interesting. The drinks are specially concocted by a mixologist and a little fun fact the team shared with us was that the Ang-Mo-Politan was named after said mixologist. He’s an ang-moh so… Ang-Mo-Politan. Heh.  The Popcorn Lover ($7) literally tasted like popcorn! Right after my first sip, I stared incredulously at my colleague in disbelief. Besides the popcorn flavour, there was also a hint of tartness from the calamansi juice which made the drink really refreshing. It was a fun and novel drink that we both adored – kudos to the team for nailing this perfectly. Thank goodness we had room for dessert because I wouldn’t have wanted to miss the Pulut Hitam ($5.50). Described as one of the most popular dishes, the black sticky rice dessert had just the right amount of sweetness and it was such a nostalgic treat! It was dense and fragrant and had a really nice texture; not too mushy and not too hard. The coconut ice cream was really creamy and really enhanced the flavour of the dish. If you’re looking for somewhere with a good ambience, feel-good AND tasty food, you should probably swing by Punggol Park soon. As my colleague aptly summed up: “10/10 would marry the chef(‘s food)”.  A final tip: download the Five &2 membership app to earn a 10% rebate on your orders. This means that if you spend $50 on one occasion, you’ll get a $5 credit to be used immediately for your next meal. Winning!  Expected damage: $7 – $30 per pax",
        "0": {
            "cost_for_user": "NA",
            "latitude": "NA",
            "longtitude": "NA",
            "transport_type": "NA",
            "transport_type_id": "NA",
            "node": "NA",
            "start_vid": "NA",
            "end_vid": "NA",
            "start_user": 0,
            "start_user_name": "web_host",
            "restaurant_x": "103.8982977",
            "restaurant_y": "1.37513576"
        }
    },
    "MS DURIAN": {
        "price": "S$5 – S$15 per pax",
        "rating": "5.0",
        "place_id": "NA",
        "total_cost": "NA",
        "address": "51 Upper Serangoon Road, Poiz Centre, #01-70",
        "postal_code": "347697",
        "operating_hours": "Operating Hours: 9am - 10pm (Daily)",
        "pictures": "{https://sethlui.com/wp-content/uploads/2019/06/Ms-Durian-1.jpg,https://sethlui.com/wp-content/uploads/2019/06/Ms-Durian-3.jpg,https://sethlui.com/wp-content/uploads/2019/06/Ms-Durian-5.jpg,https://sethlui.com/wp-content/uploads/2019/06/Ms-Durian-6.jpg,https://sethlui.com/wp-content/uploads/2019/06/Ms-Durian-4.jpg,https://sethlui.com/wp-content/uploads/2019/06/Ms-Durian-7.jpg,https://sethlui.com/wp-content/uploads/2019/06/Ms-Durian-8.jpg,https://sethlui.com/wp-content/uploads/2019/06/Ms-Durian-10.jpg,https://sethlui.com/wp-content/uploads/2019/06/Ms-Durian-12.jpg,https://sethlui.com/wp-content/uploads/2019/06/Ms-Durian-11.jpg,https://sethlui.com/wp-content/uploads/2019/06/Ms-Durian-13.jpg,https://sethlui.com/wp-content/uploads/2019/06/Ms-Durian-14.jpg,https://sethlui.com/wp-content/uploads/2019/06/Ms-Durian-17.jpg,https://sethlui.com/wp-content/uploads/2019/06/Ms-Durian-15.jpg,https://sethlui.com/wp-content/uploads/2019/06/Ms-Durian-18.jpg,https://sethlui.com/wp-content/uploads/2019/06/Ms-Durian-2.jpg}",
        "writeup": "If there’s one thing Singaporeans love, it’s durian. We love this King of Fruits so much that we’re always looking for new ways to incorporate it into our food. Particularly, durian desserts seem to be the way to our durian-loving hearts. And Ms Durian in Potong Pasir knows that too. Located at the far corner of the newly-opened Poiz Centre, this durian-speciality café serves up dainty and mouth-watering durian desserts. As the name suggests, it’s catered towards ladies looking for a new spot to have afternoon tea with their girlfriends, though you’re welcome as long as you love durians. The selection of durian desserts in the glass display case certainly caught my eye, and I couldn’t wait to dig in. With only seven items on their menu, I bet you could just come here with a few friends and try all of them. We started with the lightest durian dessert, the Durian Coconut Milk Pudding (S$6/bottle), and worked our way up the intensity scale. Made by steaming Mao Shan Wang durian with coconut, this pudding was smooth and fragrant. The tropical coconut notes complemented the heavier durian taste, and the blend of flavours wasn’t too sweet nor jelak. Before I knew it, I finished the whole dessert all by myself! If you prefer something with more crunch, then the Durian Craquelin (S$2 per piece, S$10 per box of five) will be right up your alley. This is the only dessert on the menu that uses D24 durian – all the others use Mao Shan Wang which is richer but also more fibrous. As a result, the Durian Craquelin had a smoother and creamier texture. Since the staff over at Ms Durian bake the crequelin choux puff pastry fresh every day, the dessert came with a crackling outer shell. I’d recommend eating the entire puff in one bite (if your mouth is big enough). The durian filling inside instantly oozed out the moment I took a bite, while the crispy shell crumbled easily. It could potentially get quite messy if you’re nibbling on it! Moving on to the two cakes on the menu, we started with the Durian Mousse Cake (S$8.50 per slice, S$65 for the whole cake) as recommended. Consisting of Mao Shan Wang durian mousse with gula melaka, the cake is topped with lightly salted macadamia nuts and finished off with light cream. The cake layers were soft and fluffy, infused with rich durian fragrance and the sticky sweetness of gula melaka. What I really liked about this cake was how light it tasted. Even though it was made with Mao Shan Wang durian, the flavour wasn’t overpowering and I could distinctly taste the other ingredients too. The macadamia nuts added a nutty finish with a hint of salt, which also helped to cut through the sweetness of the cake. This was definitely my favourite out of the two cakes. My dining companion, however, preferred the MSW Durian Cake (S$12 per slice, S$90 for the whole cake). Even though both cakes used Mao Shan Wang durian, this second cake had a much stronger taste. Chilled Mao Shan Wang durian puree is layered between vanilla sponge cake, and it’s finished off with a thin layer of Chantilly cream. The MSW Durian Cake might be light in texture, but it sure packed a punch in the flavour department. Each mouthful of the cake made me feel like I was eating an actual piece of durian. This is perfect for all of you hardcore durian lovers, though it can get jelak after a while. I’d recommend sharing it with a friend. If you’re more of a cold dessert person, then try the MSW Ice Cream (S$9 per cup) or the MSW Ice Cream Puff (S$3 per piece, S$15 for a box of five). The MSW Ice Cream is suitable for vegans too, since it’s eggless. This creamy and intense ice cream might just be one of the best durian ice creams I’ve had. Thick and rich with a lingering finish, I could even taste bits of durian flesh in each spoonful. That’s when you know they made it with real durian! The MSW Ice Cream Puff consists of the same durian ice cream within a freshly-baked choux puff. Unlike the Durian Craquelin, this puff wasn’t that crispy. Instead, it had more of a chewy texture that went well with the smooth and creamy ice cream. The lovely staff at Ms Durian are also experimenting with some non-durian items because there’s always that one person in a group of friends who doesn’t like durian. They’re refining the recipe for a hot chocolate drink made with Valrhona chocolate, and topped with a little bit of salt. Having tasted the drink, I’d really recommend giving it a try once it’s available – especially if you’re a chocolate lover. Even though Ms Durian has only recently opened, it offers a truly stunning series of durian desserts. The prices may seem a little higher than most cafes, but that’s because the quality is top-notch. It’s a great spot for catching up over desserts and tea, or you can pop by for a quick sweet treat to reward yourself at the end of a tiring workday. Expected damage: S$5 – S$15 per pax",
        "0": {
            "cost_for_user": "NA",
            "latitude": "NA",
            "longtitude": "NA",
            "transport_type": "NA",
            "transport_type_id": "NA",
            "node": "NA",
            "start_vid": "NA",
            "end_vid": "NA",
            "start_user": 0,
            "start_user_name": "web_host",
            "restaurant_x": "103.8680765",
            "restaurant_y": "1.331303514"
        }
    },
    "A•MOS PERFECT GELATO": {
        "price": "S$5.10 – S$9 per pax",
        "rating": "4.0",
        "place_id": "NA",
        "total_cost": "NA",
        "address": "51 Upper Serangoon Road, #01-22, Poiz Centre",
        "postal_code": "347697",
        "operating_hours": "Operating Hours: 11am - 9:30pm (Mon - Thu & Sun), 11am - 10pm (Fri & Sat)",
        "pictures": "{https://sethlui.com/wp-content/uploads/2019/12/amos_gelato-2.jpg,https://sethlui.com/wp-content/uploads/2019/12/amos_gelato-5.jpg,https://sethlui.com/wp-content/uploads/2019/12/amos_gelato-1.jpg,https://sethlui.com/wp-content/uploads/2019/12/amos_gelato-6-2.jpg,https://sethlui.com/wp-content/uploads/2019/12/amos_gelato-7-4.jpg,https://sethlui.com/wp-content/uploads/2019/12/amos_gelato-8-4.jpg,https://sethlui.com/wp-content/uploads/2019/12/amos_gelato-3.jpg}",
        "writeup": "Just a stone’s throw away from is a dessert store that was once a dream, now finally a reality. was opened in November 2019 as a family effort with Amos Lee, the youngest son in the family at its helm.   The cafe has a graffiti wall and neon lights which creates fun and hipster vibes. For those who want to cleanse their palates between ice cream flavours or simply need some water to wash down the sweetness, the cafe provides free-flow water for all customers.  It just so happened that the day we visited, Mr Lee, the father of the founder, was present at the store. We decided to grab the opportunity and spoke with Mr Lee to get a better insight into the creation of the brand.   The gelato shop specialises in handcrafted gelato, handmade waffles and whimsical beverages. All the products are made fresh with quality ingredients, without preservatives and pre-mixes. The A•MOS philosophy focuses on the art of making the perfect gelato for all to enjoy. Amos believes that using good ingredients is just the base to success and the rest is up to one’s diligence and appreciation for the craft. He holds a Diploma in Pastry and Bakery from At-Sunrice Global Chef Academy and has always fancied trying his hand at the art of making Italian gelato.  Beginning with our first flavour, we chose a presumably lighter gelato, Summerberies (S$5.10 for a premium scoop and cone). This gelato was slightly sour and had a good mix of sweetness that was absolutely refreshing. Made with a variety of berries, the scoop still had small bits of berries that I could taste. When paired with the crispy waffle cone, it was the perfect dessert for a sunny day in Singapore. If you’re not a berry fan, you could try the cafe’s most whimsical-looking gelato flavour— Cookie Monster (S$5.10 for a premium scoop and cone) . This delicious flavour is made with a creamy mix of cookies and cream and blue dye is added to resemble the colour of Cookie Monster from Sesame Street. Looking for something to cure your Monday blues? Try out this scoop of blue happiness!  What’s a gelato shop without a gelato flavour named after the brand? Amos Famous (S$4.60 per premium scoop) is A•MOS Gelato’s house favourite, made with cookie dough, chocolate malt and chocolate chip. The chocolate malt gave the gelato sweet yet earthy and toasty notes while the cookie dough gave a buttery and deep brown sugar flavour. We decided to get the most Singaporean-inspired waffle, the Pandan Waffle (S$9 with a scoop of premium ice cream/S$5 waffle a la carte) , to accompany the gelato scoop. It was simply divine! The waffle was crispy and provided the perfect crunch to the creamy and decadent Amos Famous.   A•MOS Perfect Gelato actually collaborated with famed gelato brand, Tom’s Palette to assist with the opening of the outlet. Tom’s Palette is founded by an award-winning gelato master who has over a decade of experience. A•MOS Perfect Gelato showcases a range of Tom’s Palette’s flavours, called the “Tom Palette’s Gelallery”.  Known for its extraordinary flavours, Tom’s Palette has a loyal fan base and the collaboration has helped A•MOS Perfect Gelato to stand out because of its similarly whimsical flavours.  My favourite out of all the flavours would definitely have to be Summerberries because of its light and fruity flavour. That’s something I always look for when choosing a dessert. When you visit A•MOS Perfect Gelato, do let us know which one is your favourite!  Expected Damage: S$5.10 – S$9 per pax",
        "0": {
            "cost_for_user": "NA",
            "latitude": "NA",
            "longtitude": "NA",
            "transport_type": "NA",
            "transport_type_id": "NA",
            "node": "NA",
            "start_vid": "NA",
            "end_vid": "NA",
            "start_user": 0,
            "start_user_name": "web_host",
            "restaurant_x": "103.8680765",
            "restaurant_y": "1.331303514"
        }
    },
    "PRODIGAL CAFE": {
        "price": "S$10 – S$20 per pax",
        "rating": "4.0",
        "place_id": "NA",
        "total_cost": "NA",
        "address": "Blk 81 Macpherson Lane, #01-55",
        "postal_code": "360081",
        "operating_hours": "Operating Hours: 8am - 10pm (daily)",
        "pictures": "{https://sethlui.com/wp-content/uploads/2019/04/prodigal-cafe-21.jpg,https://sethlui.com/wp-content/uploads/2019/04/prodigal-cafe-18.jpg,https://sethlui.com/wp-content/uploads/2019/04/prodigal-cafe-10.jpg,https://sethlui.com/wp-content/uploads/2019/04/prodigal-cafe-1.jpg}",
        "writeup": "The unassuming Prodigal Cafe is tucked away in an unassuming corner of the Tai Seng neighbourhood. Opened to little fanfare in early 2018, it’s run by the same folks that started Prodigal Roasters, which specialises in craft coffees. We were surprised to see the cafe full even on a slow, rainy Tuesday afternoon. The first thing that struck me about Prodigal Cafe was the vibe it exuded. A simple, unadorned exterior leads to a similarly clean interior, however, the cafe had a homely and welcoming atmosphere. Regular cafe-goers formed a closely-knit community which was refreshing. I really enjoyed basking in the white noise of tableside chatter, laughter and friendly conversations. Everyone seemed to know everyone else, which is something that I have not yet seen in other local cafes. Owner Glen Ho informed us that Prodigal Café recently revamped the food menu so that they can focus on improving the quality of food. Most of the food items on the menu were very breakfast-centric, making this an ideal spot to have a lazy brunch or tea with friends. All prices were nett, which was great to hear! We started with the Cream Cheese and Berry Compote (S$10). It featured sourdough bread slathered with Padano cheese, and was topped with cookie crumbs as well as white chocolate shavings. The bread was great, with a crunchy crust and a fluffy centre, with a slight chew to it. However, what I liked most about this dish was the use of Padano cheese, which had the consistency of clotted cheese and had the same mellow sweetness. The sweetness was further highlighted by the cookie crumb topping which I felt was a nice touch. The crunchy cookie crumbs really added to the overall eating experience. However, the white chocolate shavings were not that pronounced, perhaps due to the homemade berry jam. The homemade berry jam was very intense, with a tart explosion characteristic of berries. Having the jam on its own might be a little too overpowering. However, it paired surprisingly well with the sourdough bread, with the sour notes highlighting the sweetness of the Padano cheese and toppings. Next, we tried the Smoked Salmon and Eggs (S$15), which was recommended to me by a fellow cafe customer. I loved this dish for its simple, yet complementary flavours. The sourdough bread was a good base for the saltiness of the capers and in-house pickles. This quickly dissipated to give way to the sweetness of the eggs and sharp earthy rocket leaves. There were also savoury, salty and smoky notes from the smoked salmon. To be fair, the smoked salmon was a little too much on the salty side, however, it was balanced out by the other ingredients. All these flavours were brought together by the generous spread of cream cheese on the sourdough bread, which was a good substitute for butter as it wasn’t as cloying. The scrambled eggs were silky, smooth and buttery, and with a little dash of black pepper, was the perfect consistency and flavour to be pair with bread. They were so good that I would come back just to have these eggs again! The next item we had was the Prodigal Grilled Cheese (S$12), which is a bestseller at Prodigal Café. I really enjoyed the triple cheddar, mozzarella and Padano cheese blend. It was complex, with the sharp tanginess mellowing out to a subtle sweetness. The Prodigal Grilled Cheese (S$12) is made with either Japanese thick toast or in-house sourdough bread. We opted for the Japanese thick toast, which had enough volume to match the intensity of the melted cheese blend. I felt that the Prodigal Grilled Cheese (S$12) was a little one-dimensional, despite being one of the top-selling items on the menu. Having the grilled cheese with the roast pepper and rocket helped by adding some earthy sweetness. However, I would have liked it if the grilled cheese itself was slightly burnt. I personally prefer my grilled cheeses with a little smoky char which complements the sharp cheese flavours. We couldn’t leave Prodigal Cafe without trying out some of the drinks on the menu since they specialise in coffees. We had a Dirty (S$5), which featured an espresso brewed from organic Guatemalan San Pedro Necta Beans mixed in with full cream milk. Prodigal Cafe’s version of the drink featured less milk and no ice which meant that it was not diluted at all. However, it was prepared such that the coffee oils would be separated from the rest of the espresso shot. This resulted in a sweeter, light first taste that transitioned into the full-bodied, chocolatey and nutty brew. Prodigal Cafe is a hidden gem in the Tai Seng neighbourhood, and it has become a second home for the regulars living in the area. Apart from the food, I really liked the welcoming, warm and friendly vibe of the cafe. Food-wise, my favourite item would be the Smoked Salmon with Eggs (S$15) because of how well all the different ingredients came together to form a well-rounded dish. You should definitely try out the coffees when you come here too. Prodigal Café doesn’t skimp when it comes to craft coffee-making, and there will certainly be a brew that suits your palate. Expected Damage: S$10 – S$20 per pax",
        "0": {
            "cost_for_user": "NA",
            "latitude": "NA",
            "longtitude": "NA",
            "transport_type": "NA",
            "transport_type_id": "NA",
            "node": "NA",
            "start_vid": "NA",
            "end_vid": "NA",
            "start_user": 0,
            "start_user_name": "web_host",
            "restaurant_x": "103.8862967",
            "restaurant_y": "1.332169382"
        }
    },
    "All The Batter": {
        "price": "$15 – $30 per pax",
        "rating": "nan",
        "place_id": "NA",
        "total_cost": "NA",
        "address": "Adelphi Park, 17 Jasmine Road",
        "postal_code": "576585",
        "operating_hours": "None",
        "pictures": "{https://sethlui.com/wp-content/uploads/2018/01/All-The-Batter-28.jpg,https://sethlui.com/wp-content/uploads/2018/01/All-The-Batter-30.jpg,https://sethlui.com/wp-content/uploads/2018/01/All-The-Batter-01.jpg,https://sethlui.com/wp-content/uploads/2018/01/All-The-Batter-02.jpg,https://sethlui.com/wp-content/uploads/2018/01/All-The-Batter-05.jpg,https://sethlui.com/wp-content/uploads/2018/01/All-The-Batter-06.jpg,https://sethlui.com/wp-content/uploads/2018/01/All-The-Batter-07.jpg,https://sethlui.com/wp-content/uploads/2018/01/All-The-Batter-08.jpg,https://sethlui.com/wp-content/uploads/2018/01/All-The-Batter-23.jpg,https://sethlui.com/wp-content/uploads/2018/01/All-The-Batter-22.jpg,https://sethlui.com/wp-content/uploads/2018/01/All-The-Batter-25.jpg,https://sethlui.com/wp-content/uploads/2018/01/All-The-Batter-14.jpg,https://sethlui.com/wp-content/uploads/2018/01/All-The-Batter-15.jpg}",
        "writeup": "Avocado toast and millennials may have been the butt of jokes for quite a while, but there’s no denying that these creamy fruits are both healthy and delicious. At All The Batter, you can channel your inner millennial and enjoy avocados in a variety of dishes. Tucked away behind Thomson Plaza, this avocado-themed cafe serves both savoury and sweet dishes. Being a millennial myself, there was no way I could resist the chance to drop by this cafe. The cheery and bright interior was spacious, with a minimalist feel. The white tables and light wood chairs made for a very Insta-worthy backdrop too. I started off with an avocado milkshake. The Avocado Nutty Galore ($8.90) was topped with walnuts, hazelnuts and almonds, which added a crunch to the creamy drink. Even though the milkshake was rather thick, the flavour was not too overwhelming nor overly sweet because the yoghurt cream undercut the richness. The milkshake left a lingering nutty aftertaste too! All The Batter actually started off specialising in only avocado drinks, before branching out into desserts and savouries. Their inspiration came from dessert cupcakes, which taste delicious but are hardly healthy. Made from real avocados, the milkshakes here are a healthy and guilt-free alternative to other sweet desserts. I couldn’t decide which dessert to get, so I opted for the Always Batter Avocado Dessert Platter ($25), which had three different kinds of sweet avocado desserts. This platter is good for sharing too, so that you can try a bit of each. The Avocado Gula Melaka Slice ($6.50) replaced butter in the cake mix with avocados and even had additional avocado slices sandwiched between the cake layers. I liked that the cake wasn’t overly sweet because it allowed me to appreciate the blend of flavours more distinctly. The Avocado Citrus Shortbread Pie (only available on the dessert platter) was a healthier alternative to the regular pies out there. The crust was made from flax seed and had the consistency of shortbread. I liked how soft and crumbly it was, while the citrus flavour helped to reduce the richness of the smooth avocado cream butter. The Italian Avocado Yoghurt Pavlova ($12.90) was served together with avocado balls and a dollop of yoghurt. The lightly sweet meringue base was airy and complements the other ingredients well. The yoghurt also added a tartness to the mostly sweet dessert. Perfect for a light treat! We went on to trying the savoury dishes made with avocados. The Bangers & Smash ($21) is a play on the British dish ‘Bangers and Mash’. Instead of mashed potatoes, the dish had mashed avocados on top of crispy toast. I enjoyed how fresh and creamy the avocado mash tasted, especially together with the chilli flakes sprinkled on top of it. The dish also came with chicken sausages and a side of mustard sauce. I liked the light taste of the chicken sausages, which didn’t overwhelm my palate. Another savoury brunch dish was the Beech Wood Smoked Salmon Smash ($22), which came with generous servings of smoked salmon and mashed avocados. There were also olives and alfalfa sprouts, which added a distinctively “green” flavour to the dish, and I loved how the smoky flavour of the salmon blended together with the fresh sprouts. Finally, I ended the meal with yet another dessert, the Avocado Rose Ice Cream Waffle ($15). The waffle was fluffy and light on the inside, and crispy on the outside. A scoop of vanilla ice cream topped the dessert, with juicy and tart strawberry slices. The drizzle of chocolate sauce added some sweetness to the creamy avocado slices, and I couldn’t stop at one mouth. This is definitely a dessert for sharing, especially if you’ve already stuffed yourself with the other dishes. If you’re looking for a quiet spot to catch up with your friends over brunch, this avocado-themed cafe is here to make your hang-outs all the batter! Expected Damage: $15 – $30 per pax",
        "0": {
            "cost_for_user": "NA",
            "latitude": "NA",
            "longtitude": "NA",
            "transport_type": "NA",
            "transport_type_id": "NA",
            "node": "NA",
            "start_vid": "NA",
            "end_vid": "NA",
            "start_user": 0,
            "start_user_name": "web_host",
            "restaurant_x": "103.830148",
            "restaurant_y": "1.355116855"
        }
    },
    "GATHER THE MISFITS": {
        "price": "S$25 – S$50 per pax",
        "rating": "3.0",
        "place_id": "NA",
        "total_cost": "NA",
        "address": "217 Rangoon Road",
        "postal_code": "218457",
        "operating_hours": "Operating Hours: 8.30am - 5pm (Daily)",
        "pictures": "{https://sethlui.com/wp-content/uploads/2019/09/Gather-The-Misfits-4.jpg,https://sethlui.com/wp-content/uploads/2019/09/Gather-The-Misfits-12.jpg,https://sethlui.com/wp-content/uploads/2019/09/Gather-The-Misfits-17.jpg}",
        "writeup": "Unless you live in the North-East, you probably don’t frequent Rangoon Road much. While the area is not as well-known as Tiong Bahru or Tanjong Pagar, it is home to a range of cafes, from Old Hen Coffee Bar to Oriental Ice Bistro. Replacing what used to be C Plus cafe is Gather The Misfits, which is a cafe by day and a bar by night. As clichéd as it sounds, I was immediately drawn to the neon light signage, which I had mentally marked as an Instagram-worthy spot. With the wooden furniture and plants scattered around the space, the interior had homely and cosy vibes. There is even an elevated seating area which is perfect for an intimate gaming session with your friends. I hardly chance upon actual cafes that offer board and card games, so the child in me jumped at the opportunity Tucked away at the back of the cafe is a mini retail store, which is easy to miss unless you walk by on the way to the restroom. They sell a variety of notebooks, flowers and dining-ware—think of it as Etsy-meets-Naiise. After settling down at my table, I ordered some iced Cafe Latte (S$6) to combat the “Z monster” that was creeping in. I liked that the coffee didn’t taste watered down, yet the flavour of the espresso was not overly bitter. Having gotten some caffeine in my system, I moved on to try their Blue Pea Lemonade (S$5.50). I liked how the lemonade was served with a side of blue liquid that you can pour in, which provided the perfect opportunity for an Instagram boomerang. Watch the lemonade change from clear to purple! Sadly, that was where the magic ended. I only noticed the slight taste of lemonade, which I would have preferred to be stronger since there wasn’t any flavour contribution from the blue pea flower colouring. Their food menu is still very much in the works, so there wasn’t much to choose from. We ordered some of their Toasties to try, because bread is always a good idea. If you’re vegetarian, you can go for their Cauliflower Gatau With Spicy Mayo (S$9). While “mushy” isn’t the best description of food, the filling was indeed soft and mushy; a smooth paste with some cauliflower chunks and eggs. And somehow, it went well with the crispy toasted bread. Oddly, the spicy mayo dressing reminded me of nacho cheese. It was probably because of the pickled chilli and mustard used in the dressing. which kind of resembles the hint of spice that I get from nacho cheese. I thought the bold flavours of the spicy mayo complemented the plain cauliflower filling nicely. For a meat option, we tried the Prosciutto With Black Garlic Mayo (S$13). The savoury cured ham was the perfect appetite kick-starter, and the bits of cheese added some texture. However, I could not really taste much of the black garlic mayo, which would have been better if it was stronger. I also thought that the toast was a little plain, and could have used some tomatoes or lettuce for crunch. Next up, we tried their Smoked Fish With Bonito Cream (S$13). They used salmon, which was soft and flaky, though I did not taste much smokiness. A pity! While I understand that salmon can be pricey, I personally would not pay S$13 for this variation on a simple tuna sandwich. Same goes for the rest of the other Toasties, which I feel can be found at a more affordable price at other places and those would come with more fillings. Moving on to dessert, we went with their Earl Grey waffle topped with a scoop of pandan ice cream (S$9.50). I liked that the waffle was fluffy, though I thought it could’ve used some crispiness on the edges. I was disappointed that I could not detect much of the Earl Grey tea flavour in the waffle, so I would suggest trying the pandan batter instead, which might have a prominent taste. The pandan ice cream was fairly light in flavour, and while I didn’t mind it, a more distinct fragrance would have complemented the already plain waffle better. Don’t be alarmed if you see the lights dim at 6pm, because that’s when the cafe converts into a bar concept (217misfits) from Wednesdays to Saturdays. If you’re interested, they also frequently organise events at their space, like pizza tastings and beer pong nights. We tried one of their newer drinks, the Mamma Mia Sangria, priced at S$108 for a 1.5-litre jug. Instead of using Spanish red wine which is commonly found in sangria, this one uses Prosecco (sparkling white wine). There was also an addition of vodka and limoncello liqueur. For the fruity part of the drink, they used a blend of raspberry, lime, lemon and orange. They helped to provide a hint of sweetness and sourness, which helped to mellow down the acidity of the alcohol. I liked how they opted for sparkling wine, because it gave the drink a nice fizz. And even though the ethanoic taste from the vodka was strong, the drink did not burn, and glided down the throat smoothly. If you’re someone who does not enjoy the strong taste of alcohol, Stylo Milo (S$14) could be the drink for you. It is a concoction of Milo, Amarula (a hazelnut cocktail and fruit-based liquor) and rum, but I basically tasted no hint of alcohol at all. Thanks to the muted alcohol taste, the drink goes down the throat smoothly and can be pretty dangerous if you drink too much at once. Remember to pace yourself if you do try it out! They also serve bar bites, which makes great finger food to pair with your drinks. Even though everything tastes good when you’re tipsy, I have to say that their Popcorn Chicken (S$9) and Seaweed Chicken (S$9) impressed me. They were crispy on the outside, while meaty and tender on the inside. The accompanying sauces including sriracha mayo and wasabi mayo also provided a kick of spice to the chicken. Paying for the two items on their own is pretty pricey, so I would suggest getting the combo of seaweed chicken, popcorn chicken and fries at S$12 instead. While I don’t think I could justify paying over S$8 for the Toasties, I would not mind going for the waffles and coffee again. I personally prefer the bar menu, and would highly recommend a night with your friends for a round of drinks. I also particularly enjoy the chill ambience that the space provides, and would love to head back again for a session of card or board games. A game of Limpeh Says over some beer, anyone? Expected Damage: S$25 – S$50 per pax",
        "0": {
            "cost_for_user": "NA",
            "latitude": "NA",
            "longtitude": "NA",
            "transport_type": "NA",
            "transport_type_id": "NA",
            "node": "NA",
            "start_vid": "NA",
            "end_vid": "NA",
            "start_user": 0,
            "start_user_name": "web_host",
            "restaurant_x": "103.8523969",
            "restaurant_y": "1.317718149"
        }
    },
    "C PLUS": {
        "price": "S$20 – S$25 per pax",
        "rating": "2.0",
        "place_id": "NA",
        "total_cost": "NA",
        "address": "217 Rangoon Road",
        "postal_code": "218457",
        "operating_hours": "",
        "pictures": "{https://sethlui.com/wp-content/uploads/2019/01/C-Plus-2.jpg,https://sethlui.com/wp-content/uploads/2019/01/C-Plus.jpg,https://sethlui.com/wp-content/uploads/2019/01/C-Plus-8.jpg,https://sethlui.com/wp-content/uploads/2019/01/C-Plus-5.jpg,https://sethlui.com/wp-content/uploads/2019/01/C-Plus-4.jpg,https://sethlui.com/wp-content/uploads/2019/01/C-Plus-3.jpg,https://sethlui.com/wp-content/uploads/2019/01/C-Plus-6.jpg,https://sethlui.com/wp-content/uploads/2019/01/C-Plus-7.jpg,https://sethlui.com/wp-content/uploads/2019/01/C-Plus-9.jpg,https://sethlui.com/wp-content/uploads/2019/01/C-Plus-10.jpg,https://sethlui.com/wp-content/uploads/2019/01/C-Plus-11.jpg}",
        "writeup": "With a name like C Plus, it’s natural to begin taking guesses as to what ‘C’ stands for. I’ll take the guesswork out for you; it stands for ‘community’. It is the vision of having various brands and partners come together to collaborate and present a brick and mortar venue for a cafe, a florist and even a design & fabrication company. The space, located in Rangoon Road, is a mish-mash of decor styles, which makes it feel like a bunch of people had differing opinions of what aesthetic they prefer and they put everything together. In short, it definitely felt like a collaborative arena the moment I walked in. I was there to try the much-raved-about curated collection of home bakers’ goods, from the likes of @ElijahPies, @OurFirstBake and @PetiteJoyBakes. C Plus works as an excellent platform for these small-time home bakers to share their love for the craft as well as expand their home business beyond social media. But first, I needed to get my tummy filled with savoury bites. Thankfully, they’re known from some choice mains that weren’t too shoddy. The first was the Green Grilled Chicken (S$10.80), grilled chicken thigh with guacamole, served on sourdough toast and a side salad. For one, I did love the heartiness and crispiness of the sourdough toast, but the guacamole left me with very little to comment on. And when I say little, I literally mean it tasted of very little; it was simply a bright green paste that lacked flavour, leaving me confused and disappointed. But hey, at least the chicken was moist. It’s amazing that regardless of how simple it is to make a quesadilla, so many places can mess it up. Here, the It’s A Wrap! (S$10.80, with a choice of either chicken or prawns) resembles a quesadilla more than an actual wrap, so be prepared for that. In spite of its misleading name, it was actually quite delicious. I suppose I was partial to how crisp the edges were, while the melted mozzarella with chicken, salsa and red peppers just oozed like lava in my mouth. I love contrasting textures, so you could imagine how much I enjoyed this! That was until I had a whiff of this: Spice Me Up (S$10.80). The description in the menu is tame, stating that the dish is simply garlic butter prawns with a tinge of chilli, served with sourdough bread and a salad. The spiciness was punchy, but more so, the flavours were phenomenal. What I loved most was how piquant the dish was, with the use of lemongrass, chilli and garlic. It was as aromatic as it was flavourful, so it was a definite toss-up of who would get the honour of finishing off the last prawn. Besides serving cakes from home bakers, they also serve their own in-house specials of waffles and simple pastries. We went with Wheat Buttermilk Waffle (S$7.50, with a choice of either butter or chocolate/maple syrup). Having been told that the texture of the waffle differs slightly from the fluffy variety that many of us are used to, I actually enjoyed this chewier and denser version. Also, I appreciated that the chocolate sauce wasn’t overly rich — it would’ve been too overwhelming otherwise. Now, it was finally time for me to get a taste of homemade goodness. First was Matcha Latte Pie (S$7) by @ElijahPies. Using chocolate cookies as its base, the pie is filled with matcha custard and topped with slightly charred meringue. The smokiness of the matcha wasn’t intense, but I felt that the chocolate cookie crust more than made up for it. It was a balance of sweet and deep earthiness, coupled with an ideal marriage of crumble and custard. @PetitJoyBakes’ Lychee Rose Cake (S$7.50) is a simple sponge cake layered with sliced lychees, and frosted with rose water swiss meringue buttercream. The only positive point about this was how cloud-like the sponge cake was. The lychee flavour wasn’t only overpowering, but it also tasted overly sweet and artificial. It reminded me of the remaining lychee-saturated water that one finds in canned lychees. There was no character to the cake and proved to be forgettable. The third and final cake was @OurFirstBake’s Pulut Hitam Cake (S$7.50). Using coconut sponge and coconut mousse, it is topped with a glistening layer of black glutinous rice pudding, laced with gula melaka. It tastes exactly like the actual pulut hitam dessert, save for the texture of pillowy sponge layers being thrown into the mix. The only drawback for me was that the black glutinous rice pudding wasn’t mushy enough; it still felt a tad gritty. Given the not-so-accessible location of C Plus, I can understand why many cafe-hoppers would be reluctant to make the trip. I can’t say if I’d return here, solely based on its remote location. However, if cafes in isolated and out-of-the-way nooks are your thing, then this slightly hidden corner will meet your cafe criteria. Expected damage: S$20 – S$25 per pax",
        "0": {
            "cost_for_user": "NA",
            "latitude": "NA",
            "longtitude": "NA",
            "transport_type": "NA",
            "transport_type_id": "NA",
            "node": "NA",
            "start_vid": "NA",
            "end_vid": "NA",
            "start_user": 0,
            "start_user_name": "web_host",
            "restaurant_x": "103.8523969",
            "restaurant_y": "1.317718149"
        }
    },
    "Fat Po": {
        "price": "$15.90 – $30 per pax",
        "rating": "nan",
        "place_id": "NA",
        "total_cost": "NA",
        "address": "10 Tebing Lane, #01-05/06",
        "postal_code": "828836",
        "operating_hours": "None",
        "pictures": "{https://sethlui.com/wp-content/uploads/2018/07/Fat-Po-33.jpg,https://sethlui.com/wp-content/uploads/2018/07/Fat-Po-32.jpg,https://sethlui.com/wp-content/uploads/2018/07/Fat-Po-31.jpg,https://sethlui.com/wp-content/uploads/2018/07/Fat-Po-1.jpg,https://sethlui.com/wp-content/uploads/2018/07/Fat-Po-4.jpg,https://sethlui.com/wp-content/uploads/2018/07/Fat-Po-3.jpg,https://sethlui.com/wp-content/uploads/2018/07/Fat-Po-5.jpg,https://sethlui.com/wp-content/uploads/2018/07/Fat-Po-6.jpg,https://sethlui.com/wp-content/uploads/2018/07/Fat-Po-12.jpg,https://sethlui.com/wp-content/uploads/2018/07/Fat-Po-13.jpg,https://sethlui.com/wp-content/uploads/2018/07/Fat-Po-7.jpg,https://sethlui.com/wp-content/uploads/2018/07/Fat-Po-8.jpg,https://sethlui.com/wp-content/uploads/2018/07/Fat-Po-9.jpg,https://sethlui.com/wp-content/uploads/2018/07/Fat-Po-10.jpg,https://sethlui.com/wp-content/uploads/2018/07/Fat-Po-11.jpg,https://sethlui.com/wp-content/uploads/2018/07/Fat-Po-20.jpg,https://sethlui.com/wp-content/uploads/2018/07/Fat-Po-21.jpg,https://sethlui.com/wp-content/uploads/2018/07/Fat-Po-14.jpg,https://sethlui.com/wp-content/uploads/2018/07/Fat-Po-15.jpg,https://sethlui.com/wp-content/uploads/2018/07/Fat-Po-16.jpg,https://sethlui.com/wp-content/uploads/2018/07/Fat-Po-23.jpg,https://sethlui.com/wp-content/uploads/2018/07/Fat-Po-19.jpg,https://sethlui.com/wp-content/uploads/2018/07/Fat-Po-22.jpg,https://sethlui.com/wp-content/uploads/2018/07/Fat-Po-17.jpg,https://sethlui.com/wp-content/uploads/2018/07/Fat-Po-18.jpg,https://sethlui.com/wp-content/uploads/2018/07/Fat-Po-27.jpg,https://sethlui.com/wp-content/uploads/2018/07/Fat-Po-26.jpg,https://sethlui.com/wp-content/uploads/2018/07/Fat-Po-25.jpg,https://sethlui.com/wp-content/uploads/2018/07/Fat-Po-28.jpg}",
        "writeup": "Known for their Mac and Cheese worth travelling to Tebing Lane for, Whisk and Paddle is no stranger to the cafe scene. If you’re a W&P fan, then you’d be stoked to know that the same folks have a new brainchild, Fat Po, whose menu possess more of an Asian twist. The MRT and LRT ride to Fat Po might leave very little to be desired, but the ambience here more than makes up for it. You won’t miss the brightly-lit sign that jumps out at you from the driveway. A quick look inside and you’ll quickly notice how the cosy wooden interior has been retained here too, with the same warm, yellow lights. The Lychee & White Peach Frozen Yoghurt Smoothie ($7.80) was everything that we expected it to be — light, refreshing yet mildly creamy. Sometimes we avoid milky drinks fearing that they won’t do as good a job as clear drinks in quenching our thirst, but I assure you that this one does the trick nonetheless. We love gula melaka in chendol, cakes and even milk tea…but we’ve never had Gula Melaka Kopi ($4.80) before. This combination worked so well because the gula melaka helped to mask any bitterness from the coffee, and even our non-coffee-drinker colleague took to it — “this is not bad even for someone who doesn’t like coffee”, he said. I love avocado in all forms, so it was only expected of me to choose the Avocado Milkshake ($8.80). Avocado drinks usually end up being too milky, leaving the actual taste of avocado rather elusive. This, however, was really creamy and thick and frankly got us feeling like we were drinking an ice cream beverage (which can be a good or bad thing, depending on your preference). In our case, we were definitely fans of this rich yet not overly sweet shake. When Victoria, our host at Fat Po, came over to check if we were okay with fresh oysters, there was a unanimous anticipation at the table of their latest addition to the menu, Grilled Live Oysters ($24.80 for six pieces, $46.80 for 12 pieces).  We tried both flavours — Garlic Butter & Parsley and Mozzarella Cheese with Nyonya Sambal. It was tough to choose which one to start with between the two because I love cheese and garlic all the same. I enjoyed the stringiness of the mozzarella that coated the juicy oysters as well as the spicy kick from the sambal. The garlic butter, on the other hand, wasn’t as satisfying as I had hoped, and somehow tasted pretty isolated from the oyster. Out of their extensive and interesting selection of fries, the Mapo Fries ($8.80) was the first to catch our attention. If you’re familiar with mapo tofu from zi char menus, then you can probably guess how this dish came to be. Strips of deep-fried tofu topped with minced meat and spring onions, this dish reminded us fondly of the home-cooked tofu dish turned into finger food. By now, you can tell that the dishes at Fat Po involve various splashes of colour which might not do too well in photographs, but they definitely get the job done in your tummy. You could say that the Tang Xin Egg ($6.80) is a zhng-ed version of your typical ajitama. With avocado mayo, ebiko and bonito flakes, this dish meets Asian and Western in the middle. It was a pretty perfect snack to whet your appetite, and besides, you can’t really go wrong with ajitama. The Nan-ru Pork Belly ($10.80) might not be the epitome of guilty pleasure just yet, but it’s a close second. Imagine the flowing juices of fatty pork belly slices that have been battered then deep-fried — it may sound cardiac arrest-inducing, but we say it’s worth the risk. But before you wave your hands to say, “confirm too jelak“, I’m here to say that it surprisingly wasn’t. Though I would’ve loved if it was sprinkled with salt and pepper, or if there was a dip to go with it on the side. Looking awfully like the aforementioned dish, the Deep Fried Chicken Skin ($8.80) was another item on the menu that left us feeling super apologetic to our waistlines. Topping off the shiok factor for us was the belachan that packed a tangy and fiery punch. Yes, I’m that person who chooses the chicken skin at Tori Q, so it’s not hard to understand why I polished off a good one-third of this bowl (oops). We got to savour more seafood, and this time it was the Sanbei Lala ($9.80) that easily became one of our favourites here at Fat Po. The wok-fried clams with shoyu, mirin, garlic, chilli padi and scallion made a really fragrant combination without overpowering the natural flavours of the clams. The Loklok Salt+Pepper Set ($10.80) did a good job in emulating actual loklok itself, or barbecued skewers by the road side along Malaysian streets, as you might remember it by. This is great for splitting two-ways, but it can get tricky deciding who gets the prawns if there are more than just two of you. Despite the preconceived notion that barbecued meats usually end up dry, the prawns still retained their moisture. We ‘borrowed’ the belachan from earlier as a dip, which certainly did not disappoint. Fat Po also has a pretty creative range of pasta. Get the Thai Basil Pork Pasta ($15.80), if you always have basil pork rice at Thai restaurants. It came topped with an ajitama, which was an added bonus for us. The spaghetti nicely soaked up the umami flavours of the pork, making each bite burst with flavour. I absolutely looove mala, and pasta’s one of my favourite type of noodles too, so when I saw the Mala Mushroom Pasta ($14.80) on the menu I couldn’t say no. Apart from the usual toppings you get in a mala dish — mushrooms, peanuts, parsley — there was also a pair of deep-fried abalone mushrooms, borrowed from Taiwanese cuisine. (At this point I’m starting to think that Fat Po’s really taking fusion food up a notch.) Well, nothing truly beats the real deal, but the pasta was both ma (numbing) and la (spicy), so I guess it does the job. With many establishments claiming that they serve Wagyu beef bowls (but often turning out to be disappointingly tough beef slices), I was sceptical about this one. But the Angus Beef Bowl ($18.80) more than exceeded my expectations. My colleague, who hadn’t spoken about the food the whole meal, finally opened his mouth and said, “guys this is really good y’all have to try it”, and he couldn’t have been more right. The medium rare Angus Ribeye slices were well-seasoned and paired nicely with the bed of fried rice underneath them. We couldn’t leave without trying something from their new series of Bolo Burgers, and were treated to their Har Chiong Chicken Bolo Burger ($15.80). I was a fan of the crusty bolo bun, but felt that the chicken patty could use more prawn paste. My colleague on the other hand though found it to be just nice. Either way, I still think they probably did a better job than McDonald’s take on the Har Chiong Gai burger. Just when we thought we were done being wow-ed by their variety of fusion fare, Victoria emerged with three more sweet treats to send us further into a food coma. Served in a nostalgic kopi cup complete with a matching saucer, the Teh Creme Brulee ($6.80) came paired with a couple of handmade cookies. As with all creme brulees, we had fun cracking the torched layer of sugar that concealed the local tea-infused dessert beneath it. Though the cookies weren’t meant to be the star of the dish, our attention was quickly drawn to their buttery, crumbly texture that made us wish there were more than just two. I really liked how the Mango Pudding ($6.80) was plated but the dish itself wasn’t anything that special. Without a doubt, the pudding, sago and mango sauce came together to bring us a yummy classic, but I wouldn’t say that it was a must-try. The Chocolate Peanut Lava Cake ($8.80) should really have been called a lava cookie instead because of its cookie-like crust. It was also the one that I was dying to try the most. For starters, the adorable yin and yang motif couldn’t have been more apt to depict the compatibility of the peanut butter and chocolate. When dug into, the crusty outer layer gave way to a soft, viscous filling that oozed out slowly. To all fans of lava-anything, you guys need to check this one out. We came to Fat Po expecting typical overpriced cafe fare, but we stand corrected and I’d even say that I wouldn’t mind travelling all the way here just to have their unique offerings once more. Expected Damage: $15.90 – $30 per pax",
        "0": {
            "cost_for_user": "NA",
            "latitude": "NA",
            "longtitude": "NA",
            "transport_type": "NA",
            "transport_type_id": "NA",
            "node": "NA",
            "start_vid": "NA",
            "end_vid": "NA",
            "start_user": 0,
            "start_user_name": "web_host",
            "restaurant_x": "103.9174014",
            "restaurant_y": "1.393042705"
        }
    },
    "PAYA LEBAR QUARTER MALL": {
        "price": "None",
        "rating": "nan",
        "place_id": "NA",
        "total_cost": "NA",
        "address": "10 Paya Lebar Road",
        "postal_code": "409057",
        "operating_hours": "Operating Hours: 11.30am–9pm (Daily)",
        "pictures": "{https://sethlui.com/wp-content/uploads/2019/09/Paya-Lebar-Quarter-Mall-1.jpg,https://sethlui.com/wp-content/uploads/2019/09/Paya-Lebar-Quarter-Mall-2.jpg,https://sethlui.com/wp-content/uploads/2019/09/Paya-Lebar-Quarter-Mall-3.jpg,https://sethlui.com/wp-content/uploads/2019/09/Paya-Lebar-Quarter-Mall-5.jpg,https://sethlui.com/wp-content/uploads/2019/09/Paya-Lebar-Quarter-Mall-6.jpg,https://sethlui.com/wp-content/uploads/2019/09/Paya-Lebar-Quarter-Mall-7.jpg,https://sethlui.com/wp-content/uploads/2019/09/Paya-Lebar-Quarter-Mall-12.jpg,https://sethlui.com/wp-content/uploads/2019/09/Paya-Lebar-Quarter-Mall-10.jpg,https://sethlui.com/wp-content/uploads/2019/09/Paya-Lebar-Quarter-Mall-8.jpg,https://sethlui.com/wp-content/uploads/2019/09/Paya-Lebar-Quarter-Mall-14.jpg,https://sethlui.com/wp-content/uploads/2019/09/Paya-Lebar-Quarter-Mall-13.jpg,https://sethlui.com/wp-content/uploads/2019/09/Paya-Lebar-Quarter-Mall-16.jpg,https://sethlui.com/wp-content/uploads/2019/09/Paya-Lebar-Quarter-Mall-15.jpg,https://sethlui.com/wp-content/uploads/2019/09/Paya-Lebar-Quarter-Mall-18.jpg,https://sethlui.com/wp-content/uploads/2019/09/Paya-Lebar-Quarter-Mall-9.jpg,https://sethlui.com/wp-content/uploads/2019/09/Paya-Lebar-Quarter-Mall-19.jpg,https://sethlui.com/wp-content/uploads/2019/09/Paya-Lebar-Quarter-Mall-20.jpg}",
        "writeup": "The area around Paya Lebar MRT used to be almost barren. Before 2014, there was only the SingPost Centre and City Plaza in the vicinity, which did not offer many food options to people working and living in the area. Luckily, this problem was soon solved with the opening of ONEKM Mall (now called KINEX), and the completion of Paya Lebar Square. SingPost Centre also underwent a rejuvenation, making the Paya Lebar area a metropolis in the East. But despite already having malls on every front of the MRT, the area has never ceased to grow. The latest addition, Paya Lebar Quarter Mall (PLQ Mall) opened its doors to the public on 30 August 2019, bringing even more food options to the area. Armed with cash and an ravenous belly, I made my way down to PLQ Mall, to explore what this new food scene has to offer. Here are 10 food places that you should pay-a visit to at PLQ Mall: Mom’s Touch at PLQ Mall is the very first outlet from this Korean fried chicken brand on our sunny island. As its name suggests, the ideology behind Mom’s Touch is to remind diners of comforting homecooked food. We tried the Incredible Burger Combo Meal (S$9.80), a burger which includes ham, egg, some vegetables, and a big piece of fried chicken thigh. As I bit into it, an audible crunch was heard. Crispy on the outside but soft and tender on the inside, the chicken thigh was so big that I could barely hold up the burger. As we all know, Koreans love their fried chicken so of course, their menu has it too. The Mom’s Spicy Sauce Chicken (S$3.80 per piece) is covered with a layer of their signature Korean spicy sauce that’s both sweet and piquant. They also have the regular Mom’s Fried Chicken (S$3.80 per piece) if you can’t handle the spice, so don’t worry. Mom’s Touch: #01-37 | Tel: +65 6749 9959 | Opening Hours: 10am – 10pm (Sun – Thu), 10am – 11pm (Fri & Sat) | Facebook | Instagram | Website Located just outside of PLQ Mall is an open-air seating area surrounding a water feature. The therapeutic sound of water and the al fresco seating reminds me of France, and it may just be the right atmosphere you need for a dinner with your friends after a tiring day at work. While there was a lot of hype for Morphine Coffee, we decided to try East of Eden that was a few shopfronts away. Not only does East of Eden specialise in serving a good cup of joe, but they also offer customers a few selections of gelato flavours. We tried their Passionfruit Sorbet and Hokkaido Milk (S$7/double scoop, add-on S$1/cone) ice cream on a cone, which was just the thing we needed to beat the sweltering heat in Singapore. We also had a cup of Cappucino (S$5.50) and Cafe Mocha (S$6). While the coffee may not have a strong hit of caffeine, I was pleasantly surprised that the taste of espresso still shone through and the drink wasn’t overly sweet. East of Eden by The Coffee Cart: #01-P2 | Facebook | Instagram | Website Looking for some local fare instead? Head on to Red Ginger at Basement 2 of the mall. Red Ginger offers a variety of Muslim food such as Mee Siam, Mee Rebus and Lontong. If you would like to indulge in Nasi Padang, the store also offers an assortment of ingredients. The prices of each dish vary based on how many ingredients you choose to add. We decided to try the Mee Siam (S$4.80). Despite the dish looking slightly diluted at first, the assam flavour still hits the right notes of tanginess. However, we unanimously agreed that the crimson-red chilli paste could offer a bit more of a kick—though that could easily be solved by just adding more chilli to the dish. Red Ginger: #B2-31 | Tel: +65 6567 3077 | Opening Hours: 8am – 10pm (Daily) | Facebook | Instagram | Website HAYAI is a Japanese kiosk that offers a new concept for on-the-go food places. Think of the place as Subway, but for onigiri (Japanese rice balls) sandwiches. You will have a choice of meat, followed by vegetables and of course, sauce. We tried the Beef Bulgogi (S$6.50), which essentially consists of the beef itself, some vegetables, sauce, as well as some white fluffy Japanese rice wrapped in a large piece of seaweed. We also ordered the Chicken Katsu (S$5) which included a piece of chicken cutlet, some vegetables, as well as the sauce. When asked to choose our sauce for our onigiri sandwiches, we chose the Mentaiko Mayonnaise for the Beef Bulgogi and the Teriyaki marinade for the Chicken Katsu. Unfortunately, choosing the Mentaiko Mayonnaise for the Beef Bulgogi might have been a mistake. As mentaiko is quite salty while bulgogi is a sweeter marinade, the two strong flavours conflicted each other instead of complementing each other. Maybe if we had picked a lighter sauce or even no sauce, the onigiri might have a more balanced taste. Although I understand that some people may like their food to be packed with a lot of flavours, so to each their own. HAYAI: #B2-K3 | Tel: +65 9001 4050 | Opening Hours: 10am – 10pm (Daily) | Facebook | Instagram How could we not talk about the food court in a mall? After all, it is the most default place someone would go to if they can’t decide what to eat. Enter KopiTime, a new concept by food court giant Kopitiam. KopiTime has a variety of conventional staples such as chicken rice, and also food you will not commonly find in food courts like a stall that sells bingsu, a widely-known Korean shaved ice dessert. We tried out a bowl of Oreo Banana Bingsu (S$5.90) from Gangnam Bingsu. Even though the shaved ice is already sweetened with some milk, we still drizzled a cup of condensed milk on it before enjoying it. The milk-infused ice flakes in the dessert truly resembled the ones in Korea. However, I wish that the ice cream that accompanied it could have had more dimension to it as it felt like it was simply a run-of-the-mill vanilla ice cream. But for its price point, I’ll choose this any day over all the other overpriced bingsu at other Korean dessert cafes. Nevertheless, it was also interesting to see a Korean dessert stall in a local place like a food court. KopiTime: #04-11 | Opening Hours: 8am – 10pm (Daily) Another place that has been raved about was Fong Sheng Hao, a cafe that serves Taiwanese toast sets. This shop would make for a good breakfast spot or even an afternoon tea time place. We ordered the Pork Floss, Cheese and Egg Set with Teh-O Ice (S$8.20), and we were given a buzzer to collect our food. What was interesting about this place was the presentation of the food. Instead of plates, the toast was served on a metal tray and each slice of bread was beautifully grilled to a golden brown. While the bread itself was arguably one of the best slices of bread I have eaten in my life, the toast tasted more like a dessert due to the added condensed milk to the toast. If you prefer something more savoury, you could try the Pork Egg & Cheese (S$6.30) instead. Fong Sheng Hao: #B2-04 | Tel: +65 6970 0720 | Opening Hours: 8am – 9.30pm (Daily) | Facebook Health junkies, amidst all the sinful food that we have mentioned so far, there are some healthier options for you as well. One such place is smol. smol is also located near the water feature outside the mall, so you can enjoy the outdoor seating and tranquil atmosphere while tucking into your bowl of superfood. We tried the We’ve Got Beef (S$12.90), a healthier take on stir-fried beef noodles. It consisted of soba noodles, a serving of stir-fried beef, some assorted veggies, a 63ºC onsen egg, furikake (Japanese fried seasoning), and some shredded nori seaweed. We also ordered the Butter Cheekn (S$9.90), a cruelty-free version of the Indian butter chicken dish as there was no chicken in it at all. Instead, they used eggplant and tofu to substitute the chicken bits. This would serve as a good option for vegetarians. smol: #01-P3 | Tel: +65 9730 0472 | Opening Hours: 10am – 10pm (Mon – Fri), 8am – 10 pm (Sat & Sun) | Facebook Located right beside smol, Lucky Bird is an eatery that specialises in the trademark dish of Singapore—chicken rice. A plate of Steamed Soy Chicken Rice (S$7) and a bowl of Lucky Bird Okie Pokie Bowl ($7.90) here may set you back a little, however, you can rest assured that you’ll be getting your money’s worth. The chickens used in Lucky Bird’s dishes are imported from France, and are grown in a humane environment, so it is no wonder their dishes are slightly pricier than your usual S$3 chicken rice. Lucky Bird also provides a unique twist on our local favourite by offering a chicken rice Wrap N Roll (S$7.90) — which is essentially chicken rice ingredients in a wrap. Luck Bird: #01-k4 | Opening Hours: 10.30am – 9.30pm (Daily) | Facebook | Instagram | Website COLLIN’S is known for quality western cuisines at affordable prices. They offer a wide variety of finger food such as the Grilled Spiced Mid Joint Wing with Skinny Cajun Fries (S$8 for 5 pieces), Beer Battered Black and Tan Onion Rings (S$8) and Truffle Dust Fries (S$7). Apart from their sides, they also have an extensive range of mains like their Signature Grilled Chicken Chop (S$13), Pork Chop & Pork Bratwurst (S$16), and Grilled Tender US Beef Short Ribs (S$19). Think of Jack’s Place —- but more pocket-friendly. COLLIN’S Gastro Dining: #B1-01 | Tel: +65 6970 2195 | Opening Hours: 10am – 11pm (Daily) | Facebook | Instagram | Website Despite its recent opening of PLQ Mall, Morphine Coffee has already seen long queues of people waiting to get their daily caffeine fix. Apart from their coffee series, Morphine Coffee also offers other novelties such as Iced Lemon Tea with Cucumber & Mint (S$3.50) and Iced Ginger Ale (S$5). The Iced Ginger Ale is brewed in-house and contains cinnamon, so you can expect the piquant spiciness all in one cup! Alternatively, you can sit down with your date and have a good conversation over a nice cup of Matcha Latte (S$5.50) and Hojicha Latte (S$5). Morphine Coffee: #01-K5 | Tel: +65 6802 2321 | Opening Hours: 9am – 9pm (Monday to Friday), 10am – 10pm (Saturday & Sunday) | Website | Facebook | Instagram While it was nice to see that PLQ Mall has many common restaurants such as Hai Di Lao and Paradise Dynasty, it was also refreshing to see that many of its food and beverage tenants are new and offer something different as compared to all the other malls in the area. With such a good mix of anchor restaurants, as well as unique food choices that cannot be found in any other malls, PLQ Mall is definitely a must-visit.",
        "0": {
            "cost_for_user": "NA",
            "latitude": "NA",
            "longtitude": "NA",
            "transport_type": "NA",
            "transport_type_id": "NA",
            "node": "NA",
            "start_vid": "NA",
            "end_vid": "NA",
            "start_user": 0,
            "start_user_name": "web_host",
            "restaurant_x": "103.8927244",
            "restaurant_y": "1.317523846"
        }
    },
    "ORIENTAL ICE BISTRO": {
        "price": "S$12.50 per pax",
        "rating": "3.0",
        "place_id": "NA",
        "total_cost": "NA",
        "address": "89 Rangoon Road, #01-02",
        "postal_code": "218375",
        "operating_hours": "Operating Hours: 9.30am - 4.30pm (Mon - Fri), 9.30am - 2pm (Sat), Closed on Sun",
        "pictures": "{https://sethlui.com/wp-content/uploads/2019/08/Oriental-Ice-Bistro-Rangoon-Road-12.jpg,https://sethlui.com/wp-content/uploads/2019/08/Oriental-Ice-Bistro-Rangoon-Road-11.jpg,https://sethlui.com/wp-content/uploads/2019/08/Oriental-Ice-Bistro-Rangoon-Road-16.jpg,https://sethlui.com/wp-content/uploads/2019/08/Oriental-Ice-Bistro-Rangoon-Road-5.jpg,https://sethlui.com/wp-content/uploads/2019/08/Oriental-Ice-Bistro-Rangoon-Road-6.jpg,https://sethlui.com/wp-content/uploads/2019/08/Oriental-Ice-Bistro-Rangoon-Road-14.jpg}",
        "writeup": "You know how you just crave something icy-cold when the weather gets unbearably hot? That was how we felt when we were on our way to Oriental Ice Bistro, located at 89 Rangoon Road. Thankfully, upon reaching the bistro, their XXL-sized bingsu was there to provide us with some respite from the heat. We ordered their Overdose Bingsu (S$24.90)and Coffee Awakening Bingsu (S$15.90) to cool ourselves down, and a Naughty Cookie Butter Shake (S$12.90) too. And while others end off their meals with dessert, we rounded off ours with a tummy-warming Baked Beef Macaroni (S$11.90). As we waited for our orders to arrive, we took some time to soak in the bistro’s unique interior. Unlike most bingsu places which you’d usually expect to be air-conditioned, Oriental Ice Bistro has an open-air concept with urban-themed decor and furniture. When the Overdose Bingsu (S$24.90) finally arrived, I was glad I had someone to attempt the humongous bowl of shaved ice with. It comes with three flavours—chocolate ice cream and banana slices, cookies and cream ice cream with Oreo bits, as well as matcha ice cream with azuki beans. With a race against time (or the melting ice), our first order of business was to get the milk all over the bingsu. And because we all know how messy that can get, we appreciated that the milk came packaged in syringes. After all the rushing, we could finally dig in to the overwhelming portion of bingsu.  The cookies and cream ice cream reminded me of the kind that you get from the ice cream carts after school, and went well with the crunchy Oreo bits. The chocolate ice cream tasted pretty ordinary and reminded me of the generic ones you get from the tub. The banana slices were fresh and ripe though, and made for a simple chocolate and banana combo when paired with the chocolate ice cream. The matcha ice cream was rich and creamy, which went well with the sweet and chewy azuki beans. But I felt like the matcha had an artificial taste, and lacked the lightness that Japanese matcha ice cream usually has. Overall, apart from the excitement of having a gigantic-sized bowl of shaved ice, I found the Overdose Bingsu (S$24.90) to be pretty ordinary-tasting except that you get to enjoy a combination of flavours at one go. I suppose it is good for sharing with two to three friends and is fairly cheaper than getting individual portions that we most likely can’t finish. As a coffee lover, I was actually more excited for the Coffee Awakening Bingsu (S$15.90), because I had yet to try my favourite beverage in the form of a bingsu. After going through the usual routine of pouring the milk and getting that Instagram boomerang shot, I dug into the coffee-flavoured bingsu and was not disappointed. Even though the mocha chip ice cream did not have as strong of a coffee flavour I would have liked, there was still a slight hint of espresso as well as sweetness from the chocolate. With each spoonful of crunchy granola toppings, ice cream and shaved ice, it felt like I was biting into one of those nostalgic nut-coated ice cream on a stick that you can find at mama shops. Even though at this point we had long passed our limit for sugar intake, we had to give their Naughty Cookie Butter Shake (S$12.90) a try. It comes with a peanut butter shake, topped with vanilla ice cream, brownies, wafer, nuts and marshmallows. I appreciated that the milkshake was on the thinner side and was fairly easy to drink through the straw, but I found the peanut butter flavour to be quite watered-down. It would have tasted better if it was thicker and more concentrated. I thought the marshmallows added a nice pop of colour to the otherwise dull-looking drink, but they were almost too tough to bite into. My friend suggested that perhaps the marshmallows were torched, which might explain the tough texture. It would have been better if the marshmallows were soft and fluffy though. The slice of brownie was slightly bland, and was not as sweet, chewy and sticky as I would have liked it to be. Overall, their peanut butter shake was a tad lacking in terms of flavour and texture. It was such a pity since I was initially really excited to try the shake. After filling our stomachs with cold desserts, it was time to warm up with a piping hot Baked Beef Macaroni (S$11.90). Even though the portion looks slightly small, it actually feeds two people quite adequately. The cheese was stringy and chewy without being tough, and melted in our mouths nicely. The charred areas from baking also added a nice smokiness to the cheese. The macaroni was soft, and when eaten with the cheese made for a simple but comforting meal. The minced beef was also fairly tender but still had a bite to it. I also liked that the tomato sauce and chunks added a nice sweetness and acidity that helped to cut through the cheesiness of the dish. Overall, this was a nice heartwarming dish to round up our visit at Oriental Ice Bistro. While we came for the XXL-sized bingsu, I left with the Coffee Awakening Bingsu and Baked Beef Macaroni lingering fondly in my mind. If I was in the Rangoon Road area, I wouldn’t mind having a nice lunch catch-up with my friends over bingsu and perhaps we could try out some of the other mains too. Expected Damage: S$12.50 per pax",
        "0": {
            "cost_for_user": "NA",
            "latitude": "NA",
            "longtitude": "NA",
            "transport_type": "NA",
            "transport_type_id": "NA",
            "node": "NA",
            "start_vid": "NA",
            "end_vid": "NA",
            "start_user": 0,
            "start_user_name": "web_host",
            "restaurant_x": "103.8539062",
            "restaurant_y": "1.314164139"
        }
    }
}